[
  {
    "name": "Barbell Bent Over One-Arm Long Bar Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "lower back",
      "traps"
    ],
    "instructions": [
      "Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.",
      "Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.",
      "Now grab the bar with one arm just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.",
      "Pull the bar straight up with your elbow in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Do not allow for any swinging of the torso. Only the arm should move.",
      "Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).",
      "Repeat for the recommended amount of repetitions and switch arms."
    ],
    "category": "strength",
    "id": "Bent_Over_One-Arm_Long_Bar_Row",
    "original_name": "Bent Over One-Arm Long Bar Row",
    "app_category": "back"
  },
  {
    "name": "Barbell One-Arm Long Bar Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats"
    ],
    "instructions": [
      "Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.",
      "Stand next to the bar, and take a grip with one hand close to the collar. Using your hips and legs, rise to a standing position.",
      "Assume a bent-knee stance with your hips back and your chest up. Your arm should be extended. This will be your starting position.",
      "Pull the weight to your side by retracting the shoulder and flexing the elbow. Do not jerk the weight or cheat during the movement.",
      "After a brief pause, return to the starting position."
    ],
    "category": "strength",
    "id": "One-Arm_Long_Bar_Row",
    "original_name": "One-Arm Long Bar Row",
    "app_category": "back"
  },
  {
    "name": "Barbell Shrug",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "traps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand up straight with your feet at shoulder width as you hold a barbell with both hands in front of you using a pronated grip (palms facing the thighs). Tip: Your hands should be a little wider than shoulder width apart. You can use wrist wraps for this exercise for a better grip. This will be your starting position.",
      "Raise your shoulders up as far as you can go as you breathe out and hold the contraction for a second. Tip: Refrain from trying to lift the barbell by using your biceps.",
      "Slowly return to the starting position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Shrug",
    "original_name": "Barbell Shrug",
    "app_category": "back"
  },
  {
    "name": "Barbell Shrug Behind The Back",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "traps"
    ],
    "secondaryMuscles": [
      "forearms",
      "middle back"
    ],
    "instructions": [
      "Stand up straight with your feet at shoulder width as you hold a barbell with both hands behind your back using a pronated grip (palms facing back). Tip: Your hands should be a little wider than shoulder width apart. You can use wrist wraps for this exercise for better grip. This will be your starting position.",
      "Raise your shoulders up as far as you can go as you breathe out and hold the contraction for a second. Tip: Refrain from trying to lift the barbell by using your biceps. The arms should remain stretched out at all times.",
      "Slowly return to the starting position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Shrug_Behind_The_Back",
    "original_name": "Barbell Shrug Behind The Back",
    "app_category": "back"
  },
  {
    "name": "Barbell Straight Bar Bench Mid Rows",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats"
    ],
    "instructions": [
      "Place a loaded barbell on the end of a bench. Standing on the bench behind the bar, take a medium, pronated grip. Stand with your hips back and chest up, maintaining a neutral spine. This will be your starting position.",
      "Row the bar to your torso by retracting the shoulder blades and flexing the elbows. Use a controlled movement with no jerking.",
      "After a brief pause, slowly return the bar to the starting position, ensuring to go all the way down."
    ],
    "category": "strength",
    "id": "Straight_Bar_Bench_Mid_Rows",
    "original_name": "Straight Bar Bench Mid Rows",
    "app_category": "back"
  },
  {
    "name": "Barbell T-Bar Row with Handle",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats"
    ],
    "instructions": [
      "Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.",
      "Stand over the bar, and position a Double D row handle around the bar next to the collar. Using your hips and legs, rise to a standing position.",
      "Assume a wide stance with your hips back and your chest up. Your arms should be extended. This will be your starting position.",
      "Pull the weight to your upper abdomen by retracting the shoulder blades and flexing the elbows. Do not jerk the weight or cheat during the movement.",
      "After a brief pause, return to the starting position."
    ],
    "category": "strength",
    "id": "T-Bar_Row_with_Handle",
    "original_name": "T-Bar Row with Handle",
    "app_category": "back"
  },
  {
    "name": "Bent Over Barbell Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Holding a barbell with a pronated grip (palms facing down), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.",
      "Now, while keeping the torso stationary, breathe out and lift the barbell to you. Keep the elbows close to the body and only use the forearms to hold the weight. At the top contracted position, squeeze the back muscles and hold for a brief pause.",
      "Then inhale and slowly lower the barbell back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Bent_Over_Barbell_Row",
    "original_name": "Bent Over Barbell Row",
    "app_category": "back"
  },
  {
    "name": "Bent Over Two-Dumbbell Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "With a dumbbell in each hand (palms facing your torso), bend your knees slightly and bring your torso forward by bending at the waist; as you bend make sure to keep your back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.",
      "While keeping the torso stationary, lift the dumbbells to your side (as you breathe out), keeping the elbows close to the body (do not exert any force with the forearm other than holding the weights). On the top contracted position, squeeze the back muscles and hold for a second.",
      "Slowly lower the weight again to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Bent_Over_Two-Dumbbell_Row",
    "original_name": "Bent Over Two-Dumbbell Row",
    "app_category": "back"
  },
  {
    "name": "Bent Over Two-Dumbbell Row With Palms In",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats"
    ],
    "instructions": [
      "With a dumbbell in each hand (palms facing each other), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.",
      "While keeping the torso stationary, lift the dumbbells to your side as you breathe out, squeezing your shoulder blades together. On the top contracted position, squeeze the back muscles and hold for a second.",
      "Slowly lower the weight again to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Bent_Over_Two-Dumbbell_Row_With_Palms_In",
    "original_name": "Bent Over Two-Dumbbell Row With Palms In",
    "app_category": "back"
  },
  {
    "name": "Cable Shrugs",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "cable",
    "primaryMuscles": [
      "traps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Grasp a cable bar attachment that is attached to a low pulley with a shoulder width or slightly wider overhand (palms facing down) grip.",
      "Stand erect close to the pulley with your arms extended in front of you holding the bar. This will be your starting position.",
      "Lift the bar by elevating the shoulders as high as possible as you exhale. Hold the contraction at the top for a second. Tip: The arms should remain extended at all times. Refrain from using the biceps to help lift the bar. Only the shoulders should be moving up and down.",
      "Lower the bar back to the original position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Cable_Shrugs",
    "original_name": "Cable Shrugs",
    "app_category": "back"
  },
  {
    "name": "Cat Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "middle back",
      "traps"
    ],
    "instructions": [
      "Position yourself on the floor on your hands and knees.",
      "Pull your belly in and round your spine, lower back, shoulders, and neck, letting your head drop.",
      "Hold for 15 seconds."
    ],
    "category": "stretching",
    "id": "Cat_Stretch",
    "original_name": "Cat Stretch",
    "app_category": "back"
  },
  {
    "name": "Child's Pose",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "glutes",
      "middle back"
    ],
    "instructions": [
      "Get on your hands and knees, walk your hands in front of you.",
      "Lower your buttocks down to sit on your heels. Let your arms drag along the floor as you sit back to stretch your entire spine.",
      "Once you settle onto your heels, bring your hands next to your feet and relax. \"breathe\" into your back. Rest your forehead on the floor. Avoid this position if you have knee problems."
    ],
    "category": "stretching",
    "id": "Childs_Pose",
    "original_name": "Child's Pose",
    "app_category": "back"
  },
  {
    "name": "Chin-ups",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "forearms",
      "middle back"
    ],
    "instructions": [
      "Grab the pull-up bar with the palms facing your torso and a grip closer than the shoulder width.",
      "As you have both arms extended in front of you holding the bar at the chosen grip width, keep your torso as straight as possible while creating a curvature on your lower back and sticking your chest out. This is your starting position. Tip: Keeping the torso as straight as possible maximizes biceps stimulation while minimizing back involvement.",
      "As you breathe out, pull your torso up until your head is around the level of the pull-up bar. Concentrate on using the biceps muscles in order to perform the movement. Keep the elbows close to your body. Tip: The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.",
      "After a second of squeezing the biceps in the contracted position, slowly lower your torso back to the starting position; when your arms are fully extended. Breathe in as you perform this portion of the movement.",
      "Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Chin-Up",
    "original_name": "Chin-Up",
    "app_category": "back"
  },
  {
    "name": "Dumbbell Incline Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "forearms",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Using a neutral grip, lean into an incline bench.",
      "Take a dumbbell in each hand with a neutral grip, beginning with the arms straight. This will be your starting position.",
      "Retract the shoulder blades and flex the elbows to row the dumbbells to your side.",
      "Pause at the top of the motion, and then return to the starting position."
    ],
    "category": "strength",
    "id": "Dumbbell_Incline_Row",
    "original_name": "Dumbbell Incline Row",
    "app_category": "back"
  },
  {
    "name": "Dumbbell Shrug",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "traps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand erect with a dumbbell on each hand (palms facing your torso), arms extended on the sides.",
      "Lift the dumbbells by elevating the shoulders as high as possible while you exhale. Hold the contraction at the top for a second. Tip: The arms should remain extended at all times. Refrain from using the biceps to help lift the dumbbells. Only the shoulders should be moving up and down.",
      "Lower the dumbbells back to the original position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Dumbbell_Shrug",
    "original_name": "Dumbbell Shrug",
    "app_category": "back"
  },
  {
    "name": "Hug A Ball",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "exercise ball",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes"
    ],
    "instructions": [
      "Seat yourself on the floor.",
      "Straddle an exercise ball between both legs and lower your hips down toward the floor.",
      "Hug your arms around the ball to support your body. Adjust your legs so that your feet are flat on the floor and your knees line up over your ankles. Keep a good grip on the ball so it doesn't roll away from you and send you back onto your buttocks."
    ],
    "category": "stretching",
    "id": "Hug_A_Ball",
    "original_name": "Hug A Ball",
    "app_category": "back"
  },
  {
    "name": "Incline Bench Pull",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Grab a dumbbell in each hand and lie face down on an incline bench that is set to an incline that is approximately 30 degrees.",
      "Let the arms hang to your sides fully extended as they point to the floor.",
      "Turn the wrists until your hands have a pronated (palms down) grip.",
      "Now flare the elbows out. This will be your starting position.",
      "As you breathe out, start to pull the dumbbells up as if you are doing a reverse bench press. You will do this by bending at the elbows and bringing the upper arms up as you let the forearms hang. Continue this motion until the upper arms are at the same level as your back. Tip: The elbows will come out to the side and your upper arms and torso should make the letter \"T\" at the top of the movement. Hold the contraction at the top for a second.",
      "Slowly go back down to the starting position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Incline_Bench_Pull",
    "original_name": "Incline Bench Pull",
    "app_category": "back"
  },
  {
    "name": "Inverted Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": null,
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "lats"
    ],
    "instructions": [
      "Position a bar in a rack to about waist height. You can also use a smith machine.",
      "Take a wider than shoulder width grip on the bar and position yourself hanging underneath the bar. Your body should be straight with your heels on the ground with your arms fully extended. This will be your starting position.",
      "Begin by flexing the elbow, pulling your chest towards the bar. Retract your shoulder blades as you perform the movement.",
      "Pause at the top of the motion, and return yourself to the start position.",
      "Repeat for the desired number of repetitions."
    ],
    "category": "strength",
    "id": "Inverted_Row",
    "original_name": "Inverted Row",
    "app_category": "back"
  },
  {
    "name": "Leverage Shrug",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "machine",
    "primaryMuscles": [
      "traps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Load the pins to an appropriate weight. Position yourself directly between the handles.",
      "Grasp the top handles with a comfortable grip, and then lower your hips as you take a breath. Look forward with your head and keep your chest up.",
      "Drive through the floor with your heels, extending your hips and knees as you rise to a standing position. Keep your arms straight throughout the movement, finishing with your shoulders back. This will be your starting position.",
      "Raise the weight by shrugging the shoulders towards your ears, moving straight up and down.",
      "Pause at the top of the motion, and then return the weight to the starting position."
    ],
    "category": "strength",
    "id": "Leverage_Shrug",
    "original_name": "Leverage Shrug",
    "app_category": "back"
  },
  {
    "name": "Lower Back-SMR",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": "foam roll",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "In a seated position, place a foam roll under your lower back. Cross your arms in front of you and protract your shoulders. This will be your starting position.",
      "Raise your hips off of the floor and lean back, keeping your weight on your lower back. Now shift your weight slightly to one side, keeping your weight off of the spine and on the muscles to the side of it. Roll over your lower back, holding points of tension for 10-30 seconds. Repeat on the other side."
    ],
    "category": "stretching",
    "id": "Lower_Back-SMR",
    "original_name": "Lower Back-SMR",
    "app_category": "back"
  },
  {
    "name": "Lying Cambered Barbell Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "traps"
    ],
    "instructions": [
      "Place a cambered bar underneath an exercise bench.",
      "Lie face down on the exercise bench and grab the bar using a palms down (pronated grip) that is wider than shoulder width. This will be your starting position.",
      "As you exhale row the bar up as you keep the elbows close to your body to either your chest, in order to target the upper mid back, or to your stomach if targeting the lats is your goal.",
      "After a second hold at the top, lower back down to the starting position slowly as you inhale."
    ],
    "category": "strength",
    "id": "Lying_Cambered_Barbell_Row",
    "original_name": "Lying Cambered Barbell Row",
    "app_category": "back"
  },
  {
    "name": "One-Arm Dumbbell Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "shoulders"
    ],
    "instructions": [
      "Choose a flat bench and place a dumbbell on each side of it.",
      "Place the right leg on top of the end of the bench, bend your torso forward from the waist until your upper body is parallel to the floor, and place your right hand on the other end of the bench for support.",
      "Use the left hand to pick up the dumbbell on the floor and hold the weight while keeping your lower back straight. The palm of the hand should be facing your torso. This will be your starting position.",
      "Pull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms.",
      "Lower the resistance straight down to the starting position. Breathe in as you perform this step.",
      "Repeat the movement for the specified amount of repetitions.",
      "Switch sides and repeat again with the other arm."
    ],
    "category": "strength",
    "id": "One-Arm_Dumbbell_Row",
    "original_name": "One-Arm Dumbbell Row",
    "app_category": "back"
  },
  {
    "name": "Overhead Slam",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "medicine ball",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Hold a medine ball with both hands and stand with your feet at shoulder width. This will be your starting position.",
      "Initiate the countermovement by raising the ball above your head and fully extending your body.",
      "Reverse the motion, slamming the ball into the ground directly in front of you as hard as you can.",
      "Receive the ball with both hands on the bounce and repeat the movement."
    ],
    "category": "plyometrics",
    "id": "Overhead_Slam",
    "original_name": "Overhead Slam",
    "app_category": "back"
  },
  {
    "name": "Pull-ups",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back"
    ],
    "instructions": [
      "Grab the pull-up bar with the palms facing forward using the prescribed grip. Note on grips: For a wide grip, your hands need to be spaced out at a distance wider than your shoulder width. For a medium grip, your hands need to be spaced out at a distance equal to your shoulder width and for a close grip at a distance smaller than your shoulder width.",
      "As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.",
      "Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.",
      "After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.",
      "Repeat this motion for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Pullups",
    "original_name": "Pullups",
    "app_category": "back"
  },
  {
    "name": "Pyramid",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": "exercise ball",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "shoulders"
    ],
    "instructions": [
      "Start off by rolling your torso forward onto the ball so your hips rest on top of the ball and become the highest point of your body.",
      "Rest your hands and feet on the floor. Your arms and legs can be slightly bent or straight, depending on the size of the ball, your flexibility, and the length of your limbs. This also helps develop stabilizing strength in your torso and shoulders."
    ],
    "category": "stretching",
    "id": "Pyramid",
    "original_name": "Pyramid",
    "app_category": "back"
  },
  {
    "name": "Spinal Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "middle back"
    ],
    "secondaryMuscles": [
      "lats",
      "lower back",
      "neck",
      "traps"
    ],
    "instructions": [
      "Sit in a chair so your back is straight and your feet planted on the floor.",
      "Interlace your fingers behind your head, elbows out and your chin down.",
      "Twist your upper body to one side about 3 times as far as you can. Then lean forward and twist your torso to reach your elbow to the floor on the inside of your knee.",
      "Return to upright position and then repeat for your other side."
    ],
    "category": "stretching",
    "id": "Spinal_Stretch",
    "original_name": "Spinal Stretch",
    "app_category": "back"
  },
  {
    "name": "Standing Dumbbell Upright Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "traps"
    ],
    "secondaryMuscles": [
      "biceps",
      "shoulders"
    ],
    "instructions": [
      "Grasp a dumbbell in each hand with a pronated (palms forward) grip that is slightly less than shoulder width. The dumbbells should be resting on top of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position.",
      "Use your side shoulders to lift the dumbbells as you exhale. The dumbbells should be close to the body as you move it up and the elbows should drive the motion. Continue to lift them until they nearly touch your chin. Tip: Your elbows should drive the motion. As you lift the dumbbells, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement.",
      "Lower the dumbbells back down slowly to the starting position. Inhale as you perform this portion of the movement.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Standing_Dumbbell_Upright_Row",
    "original_name": "Standing Dumbbell Upright Row",
    "app_category": "back"
  },
  {
    "name": "Stiff Leg Barbell Good Morning",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position.",
      "Keeping your legs stationary, move your torso forward by bending at the hips while inhaling. Lower your torso until it is parallel with the floor.",
      "Begin to raise the bar as you exhale by elevating your torso back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Stiff_Leg_Barbell_Good_Morning",
    "original_name": "Stiff Leg Barbell Good Morning",
    "app_category": "back"
  },
  {
    "name": "Superman",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "lower back"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, lie straight and face down on the floor or exercise mat. Your arms should be fully extended in front of you. This is the starting position.",
      "Simultaneously raise your arms, legs, and chest off of the floor and hold this contraction for 2 seconds. Tip: Squeeze your lower back to get the best results from this exercise. Remember to exhale during this movement. Note: When holding the contracted position, you should look like superman when he is flying.",
      "Slowly begin to lower your arms, legs and chest back down to the starting position while inhaling.",
      "Repeat for the recommended amount of repetitions prescribed in your program."
    ],
    "category": "stretching",
    "id": "Superman",
    "original_name": "Superman",
    "app_category": "back"
  },
  {
    "name": "V-Bar Pullup",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "lats"
    ],
    "secondaryMuscles": [
      "biceps",
      "middle back",
      "shoulders"
    ],
    "instructions": [
      "Start by placing the middle of the V-bar in the middle of the pull-up bar (assuming that the pull-up station you are using does not have neutral grip handles). The V-Bar handles will be facing down so that you can hang from the pull-up bar through the use of the handles.",
      "Once you securely place the V-bar, take a hold of the bar from each side and hang from it. Stick your chest out and lean yourself back slightly in order to better engage the lats. This will be your starting position.",
      "Using your lats, pull your torso up while leaning your head back slightly so that you do not hit yourself with the chin-up bar. Continue until your chest nearly touches the V-bar. Exhale as you execute this motion.",
      "After a second hold on the contracted position, slowly lower your body back to the starting position as you breathe in.",
      "Repeat for the prescribed number of repetitions."
    ],
    "category": "strength",
    "id": "V-Bar_Pullup",
    "original_name": "V-Bar Pullup",
    "app_category": "back"
  },
  {
    "name": "Barbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. This will be your starting position.",
      "While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.",
      "Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.",
      "Slowly begin to bring the bar back to starting position as your breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Curl",
    "original_name": "Barbell Curl",
    "app_category": "biceps"
  },
  {
    "name": "Barbell Curls Lying Against An Incline",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie against an incline bench, with your arms holding a barbell and hanging down in a horizontal line. This will be your starting position.",
      "While keeping the upper arms stationary, curl the weight up as high as you can while squeezing the biceps. Breathe out as you perform this portion of the movement. Tip: Only the forearms should move. Do not swing the arms.",
      "After a second contraction, slowly go back to the starting position as you inhale. Tip: Make sure that you go all of the way down.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Curls_Lying_Against_An_Incline",
    "original_name": "Barbell Curls Lying Against An Incline",
    "app_category": "biceps"
  },
  {
    "name": "Barbell EZ Bar Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Stand up with your torso upright while holding an E-Z Curl Bar at the closer inner handle. The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar. The elbows should be close to the torso. This will be your starting position.",
      "While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.",
      "Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.",
      "Slowly begin to bring the bar back to starting position as your breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Close-Grip_EZ_Bar_Curl",
    "original_name": "Close-Grip EZ Bar Curl",
    "app_category": "biceps"
  },
  {
    "name": "Barbell Preacher Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "To perform this movement you will need a preacher bench and an E-Z bar. Grab the E-Z curl bar at the close inner handle (either have someone hand you the bar which is preferable or grab the bar from the front bar rest provided by most preacher benches). The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar.",
      "With the upper arms positioned against the preacher bench pad and the chest against it, hold the E-Z Curl Bar at shoulder length. This will be your starting position.",
      "As you breathe in, slowly lower the bar until your upper arm is extended and the biceps is fully stretched.",
      "As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the bar is at shoulder height. Squeeze the biceps hard and hold this position for a second.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Preacher_Curl",
    "original_name": "Preacher Curl",
    "app_category": "biceps"
  },
  {
    "name": "Dumbbell Bicep Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.",
      "Now, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps.",
      "Then, inhale and slowly begin to lower the dumbbells back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Dumbbell_Bicep_Curl",
    "original_name": "Dumbbell Bicep Curl",
    "app_category": "biceps"
  },
  {
    "name": "Dumbbell Concentration Curls",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Sit down on a flat bench with one dumbbell in front of you between your legs. Your legs should be spread with your knees bent and feet on the floor.",
      "Use your right arm to pick the dumbbell up. Place the back of your right upper arm on the top of your inner right thigh. Rotate the palm of your hand until it is facing forward away from your thigh. Tip: Your arm should be extended and the dumbbell should be above the floor. This will be your starting position.",
      "While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: At the top of the movement make sure that the little finger of your arm is higher than your thumb. This guarantees a good contraction. Hold the contracted position for a second as you squeeze the biceps.",
      "Slowly begin to bring the dumbbells back to starting position as your breathe in. Caution: Avoid swinging motions at any time.",
      "Repeat for the recommended amount of repetitions. Then repeat the movement with the left arm."
    ],
    "category": "strength",
    "id": "Concentration_Curls",
    "original_name": "Concentration Curls",
    "app_category": "biceps"
  },
  {
    "name": "Dumbbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Stand (torso upright) with a dumbbell in each hand held at arms length. The elbows should be close to the torso and the palms of your hand should be facing your thighs.",
      "While holding the upper arm stationary, curl the right weight as you rotate the palm of the hands until they are facing forward. At this point continue contracting the biceps as you breathe out until your biceps is fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Tip: Only the forearms should move.",
      "Slowly begin to bring the dumbbell back to the starting position as your breathe in. Tip: Remember to twist the palms back to the starting position (facing your thighs) as you come down.",
      "Repeat the movement with the left hand. This equals one repetition.",
      "Continue alternating in this manner for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Dumbbell_Alternate_Bicep_Curl",
    "original_name": "Dumbbell Alternate Bicep Curl",
    "app_category": "biceps"
  },
  {
    "name": "Dumbbell Hammer Curls",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso.",
      "The palms of the hands should be facing your torso. This will be your starting position.",
      "Now, while holding your upper arm stationary, exhale and curl the weight forward while contracting the biceps. Continue to raise the weight until the biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a brief moment as you squeeze the biceps. Tip: Focus on keeping the elbow stationary and only moving your forearm.",
      "After the brief pause, inhale and slowly begin the lower the dumbbells back down to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Hammer_Curls",
    "original_name": "Hammer Curls",
    "app_category": "biceps"
  },
  {
    "name": "EZ-Bar Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "e-z curl bar",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand up straight while holding an EZ curl bar at the wide outer handle. The palms of your hands should be facing forward and slightly tilted inward due to the shape of the bar. Keep your elbows close to your torso. This will be your starting position.",
      "Now, while keeping your upper arms stationary, exhale and curl the weights forward while contracting the biceps. Focus on only moving your forearms.",
      "Continue to raise the weight until your biceps are fully contracted and the bar is at shoulder level. Hold the top contracted position for a moment and squeeze the biceps.",
      "Then inhale and slowly lower the bar back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "EZ-Bar_Curl",
    "original_name": "EZ-Bar Curl",
    "app_category": "biceps"
  },
  {
    "name": "Incline Dumbbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Sit back on an incline bench with a dumbbell in each hand held at arms length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.",
      "While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second.",
      "Slowly begin to bring the dumbbells back to starting position as your breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Incline_Dumbbell_Curl",
    "original_name": "Incline Dumbbell Curl",
    "app_category": "biceps"
  },
  {
    "name": "Lying Supine Dumbbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie down on a flat bench face up while holding a dumbbell in each arm on top of your thighs.",
      "Bring the dumbbells to the sides with the arms extended and the palms of the hands facing your thighs (neutral grip).",
      "While keeping the arms close to your torso and elbows in, slowly lower your arms (as you keep them extended with a slight bend at the elbows) as far down towards the floor as you can go. Once you cannot go down any further, lock your upper arms in that position and that will be your starting position.",
      "As you breathe out, slowly begin to curl the weights up as you simultaneously rotate your wrists so that the palms of the hands face up. Continue curling the weight until your biceps are fully contracted and squeeze hard at the top position for a second. Tip: Only the forearms should move. Upper arms should remain stationary and elbows should stay in throughout the movement.",
      "Return back to the starting position very slowly."
    ],
    "category": "strength",
    "id": "Lying_Supine_Dumbbell_Curl",
    "original_name": "Lying Supine Dumbbell Curl",
    "app_category": "biceps"
  },
  {
    "name": "Reverse Barbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Stand up with your torso upright while holding a barbell at shoulder width with the elbows close to the torso. The palm of your hands should be facing down (pronated grip). This will be your starting position.",
      "While holding the upper arms stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second as you squeeze the muscle.",
      "Slowly begin to bring the bar back to starting position as your breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Reverse_Barbell_Curl",
    "original_name": "Reverse Barbell Curl",
    "app_category": "biceps"
  },
  {
    "name": "Seated Dumbbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Sit on a flat bench with a dumbbell on each hand being held at arms length. The elbows should be close to the torso.",
      "Rotate the palms of the hands so that they are facing your torso. This will be your starting position.",
      "While holding the upper arm stationary, curl the weights and start twisting the wrists once the dumbbells pass your thighs so that the palms of your hands face forward at the end of the movement. Make sure that you contract the biceps as you breathe out and make sure that only the forearms move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps.",
      "Slowly begin to bring the dumbbells back to the starting position as your breathe in and as you rotate the wrists back to a neutral grip.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Seated_Dumbbell_Curl",
    "original_name": "Seated Dumbbell Curl",
    "app_category": "biceps"
  },
  {
    "name": "Standing Barbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "Hold a barbell with both hands, palms up and a few inches apart.",
      "Stand with your torso straight and your head up. Your feet should be about shoulder width and your elbows close to your torso. This will be your starting position. Tip: You will keep your upper arms and elbows stationary throughout the movement.",
      "Curl the bar up in a semicircular motion until the forearms touch your biceps. Exhale as you perform this portion of the movement and contract your biceps hard for a second at the top. Tip: Avoid bending the back or using swinging motions as you lift the weight. Only the forearms should move.",
      "Slowly go back down to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Close-Grip_Standing_Barbell_Curl",
    "original_name": "Close-Grip Standing Barbell Curl",
    "app_category": "biceps"
  },
  {
    "name": "Wide-Grip Standing Barbell Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "biceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand up with your torso upright while holding a barbell at the wide outer handle. The palm of your hands should be facing forward. The elbows should be close to the torso. This will be your starting position.",
      "While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.",
      "Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.",
      "Slowly begin to bring the bar back to starting position as your breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Wide-Grip_Standing_Barbell_Curl",
    "original_name": "Wide-Grip Standing Barbell Curl",
    "app_category": "biceps"
  },
  {
    "name": "Barbell Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on a flat bench. Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
      "From the starting position, breathe in and begin coming down slowly until the bar touches your middle chest.",
      "After a brief pause, push the bar back to the starting position as you breathe out. Focus on pushing the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position at the top of the motion, hold for a second and then start coming down slowly again. Tip: Ideally, lowering the weight should take about twice as long as raising it.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "id": "Barbell_Bench_Press_-_Medium_Grip",
    "original_name": "Barbell Bench Press - Medium Grip",
    "app_category": "chest"
  },
  {
    "name": "Barbell Front Raise And Pullover",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "lats",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie on a flat bench while holding a barbell using a palms down grip that is about 15 inches apart.",
      "Place the bar on your upper thighs, extend your arms and lock them while keeping a slight bend on the elbows. This will be your starting position.",
      "Now raise the weight using a semicircular motion and keeping your arms straight as you inhale. Continue the same movement until the bar is on the other side above your head . (Tip: the bar will travel approximately 180-degrees). At this point your arms should be parallel to the floor with the palms of your hands facing the ceiling.",
      "Now return the barbell to the starting position by reversing the motion as you exhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Front_Raise_And_Pullover",
    "original_name": "Front Raise And Pullover",
    "app_category": "chest"
  },
  {
    "name": "Barbell Incline Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on an incline bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
      "As you breathe in, come down slowly until you feel the bar on you upper chest.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly again. Tip: it should take at least twice as long to go down than to come up.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "id": "Barbell_Incline_Bench_Press_-_Medium_Grip",
    "original_name": "Barbell Incline Bench Press - Medium Grip",
    "app_category": "chest"
  },
  {
    "name": "Decline Barbell Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Secure your legs at the end of the decline bench and slowly lay down on the bench.",
      "Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.",
      "As you breathe in, come down slowly until you feel the bar on your lower chest.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "id": "Decline_Barbell_Bench_Press",
    "original_name": "Decline Barbell Bench Press",
    "app_category": "chest"
  },
  {
    "name": "Decline Dumbbell Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.",
      "Once you are laying down, move the dumbbells in front of you at shoulder width.",
      "Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.",
      "Bring down the weights slowly to your side as you breathe out. Keep full control of the dumbbells at all times. Tip: Throughout the motion, the forearms should always be perpendicular to the floor.",
      "As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up..",
      "Repeat the movement for the prescribed amount of repetitions of your training program."
    ],
    "category": "strength",
    "id": "Decline_Dumbbell_Bench_Press",
    "original_name": "Decline Dumbbell Bench Press",
    "app_category": "chest"
  },
  {
    "name": "Decline Dumbbell Flyes",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.",
      "Once you are laying down, move the dumbbells in front of you at shoulder width. The palms of the hands should be facing each other and the arms should be perpendicular to the floor and fully extended. This will be your starting position.",
      "With a slight bend on your elbows in order to prevent stress at the biceps tendon, lower your arms out at both sides in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms should remain stationary; the movement should only occur at the shoulder joint.",
      "Return your arms back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.",
      "Hold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Decline_Dumbbell_Flyes",
    "original_name": "Decline Dumbbell Flyes",
    "app_category": "chest"
  },
  {
    "name": "Dumbbell Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie down on a flat bench with a dumbbell in each hand resting on top of your thighs. The palms of your hands will be facing each other.",
      "Then, using your thighs to help raise the dumbbells up, lift the dumbbells one at a time so that you can hold them in front of you at shoulder width.",
      "Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. The dumbbells should be just to the sides of your chest, with your upper arm and forearm creating a 90 degree angle. Be sure to maintain full control of the dumbbells at all times. This will be your starting position.",
      "Then, as you breathe out, use your chest to push the dumbbells up. Lock your arms at the top of the lift and squeeze your chest, hold for a second and then begin coming down slowly. Tip: Ideally, lowering the weight should take about twice as long as raising it.",
      "Repeat the movement for the prescribed amount of repetitions of your training program."
    ],
    "category": "strength",
    "id": "Dumbbell_Bench_Press",
    "original_name": "Dumbbell Bench Press",
    "app_category": "chest"
  },
  {
    "name": "Dumbbell Bench Press with Neutral Grip",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Take a dumbbell in each hand and lay back onto a flat bench. Your feet should be flat on the floor and your shoulder blades retracted.",
      "Maintaining a neutral grip, palms facing each other, begin with your arms extended directly above you, perpendicular to the floor. This will be your starting position.",
      "Begin the movement by flexing the elbow, lowering the upper arms to the side. Descend until the dumbbells are to your torso.",
      "Pause, then extend the elbow and return to the starting position."
    ],
    "category": "strength",
    "id": "Dumbbell_Bench_Press_with_Neutral_Grip",
    "original_name": "Dumbbell Bench Press with Neutral Grip",
    "app_category": "chest"
  },
  {
    "name": "Dumbbell Flyes",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie down on a flat bench with a dumbbell on each hand resting on top of your thighs. The palms of your hand will be facing each other.",
      "Then using your thighs to help raise the dumbbells, lift the dumbbells one at a time so you can hold them in front of you at shoulder width with the palms of your hands facing each other. Raise the dumbbells up like you're pressing them, but stop and hold just before you lock out. This will be your starting position.",
      "With a slight bend on your elbows in order to prevent stress at the biceps tendon, lower your arms out at both sides in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms should remain stationary; the movement should only occur at the shoulder joint.",
      "Return your arms back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.",
      "Hold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Dumbbell_Flyes",
    "original_name": "Dumbbell Flyes",
    "app_category": "chest"
  },
  {
    "name": "Dumbbell Hammer Grip Incline DB Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on an incline bench with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.",
      "By using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them at shoulder width.",
      "Once at shoulder width, keep the palms of your hands with a neutral grip (palms facing each other). Keep your elbows flared out with the upper arms in line with the shoulders (perpendicular to the torso) and the elbows bent creating a 90-degree angle between the upper arm and the forearm. This will be your starting position.",
      "Now bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbells at all times.",
      "As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the dumbbells back in your thighs and then on the floor. This is the safest manner to dispose of the dumbbells."
    ],
    "category": "strength",
    "id": "Hammer_Grip_Incline_DB_Bench_Press",
    "original_name": "Hammer Grip Incline DB Bench Press",
    "app_category": "chest"
  },
  {
    "name": "Elbows Back",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders"
    ],
    "instructions": [
      "Stand up straight.",
      "Place both hands on your lower back, fingers pointing downward and elbows out.",
      "Then gently pull your elbows back aiming to touch them together."
    ],
    "category": "stretching",
    "id": "Elbows_Back",
    "original_name": "Elbows Back",
    "app_category": "chest"
  },
  {
    "name": "Incline Dumbbell Flyes",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders"
    ],
    "instructions": [
      "Hold a dumbbell in each hand and lie on an incline bench that is set to an incline angle of no more than 30 degrees.",
      "Extend your arms above you with a slight bend at the elbows.",
      "Now rotate the wrists so that the palms of your hands are facing you. Tip: The pinky fingers should be next to each other. This will be your starting position.",
      "As you breathe in, start to slowly lower the arms to the side while keeping the arms extended and while rotating the wrists until the palms of the hand are facing each other. Tip: At the end of the movement the arms will be by your side with the palms facing the ceiling.",
      "As you exhale start to bring the dumbbells back up to the starting position by reversing the motion and rotating the hands so that the pinky fingers are next to each other again. Tip: Keep in mind that the movement will only happen at the shoulder joint and at the wrist. There is no motion that happens at the elbow joint.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Incline_Dumbbell_Flyes_-_With_A_Twist",
    "original_name": "Incline Dumbbell Flyes - With A Twist",
    "app_category": "chest"
  },
  {
    "name": "Incline Dumbbell Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie back on an incline bench with a dumbbell in each hand atop your thighs. The palms of your hands will be facing each other.",
      "Then, using your thighs to help push the dumbbells up, lift the dumbbells one at a time so that you can hold them at shoulder width.",
      "Once you have the dumbbells raised to shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.",
      "Be sure to keep full control of the dumbbells at all times. Then breathe out and push the dumbbells up with your chest.",
      "Lock your arms at the top, hold for a second, and then start slowly lowering the weight. Tip Ideally, lowering the weights should take about twice as long as raising them.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the dumbbells back on your thighs and then on the floor. This is the safest manner to release the dumbbells."
    ],
    "category": "strength",
    "id": "Incline_Dumbbell_Press",
    "original_name": "Incline Dumbbell Press",
    "app_category": "chest"
  },
  {
    "name": "Incline Push-Up",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Stand facing bench or sturdy elevated platform. Place hands on edge of bench or platform, slightly wider than shoulder width.",
      "Position forefoot back from bench or platform with arms and body straight. Arms should be perpendicular to body. Keeping body straight, lower chest to edge of box or platform by bending arms.",
      "Push body up until arms are extended. Repeat."
    ],
    "category": "strength",
    "id": "Incline_Push-Up",
    "original_name": "Incline Push-Up",
    "app_category": "chest"
  },
  {
    "name": "Incline Push-Up Medium",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height.",
      "Place your hands on the bar, with your hands about shoulder width apart.",
      "Position your feet back from the bar with arms and body straight. This will be your starting position.",
      "Keeping your body straight, lower your chest to the bar by bending the arms.",
      "Return to the starting position by extending the elbows, pressing yourself back up."
    ],
    "category": "strength",
    "id": "Incline_Push-Up_Medium",
    "original_name": "Incline Push-Up Medium",
    "app_category": "chest"
  },
  {
    "name": "Incline Push-Up Wide",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height.",
      "Place your hands on the bar, with your hands wider than shoulder width.",
      "Position your feet back from the bar with arms and body straight. Your arms should be perpendicular to the body. This will be your starting position.",
      "Keeping your body straight, lower your chest to the bar by bending the arms.",
      "Return to the starting position by extending the elbows, pressing yourself back up."
    ],
    "category": "strength",
    "id": "Incline_Push-Up_Wide",
    "original_name": "Incline Push-Up Wide",
    "app_category": "chest"
  },
  {
    "name": "Isometric Chest Squeezes",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "While either seating or standing, bend your arms at a 90-degree angle and place the palms of your hands together in front of your chest. Tip: Your hands should be open with the palms together and fingers facing forward (perpendicular to your torso).",
      "Push both hands against each other as you contract your chest. Start with slow tension and increase slowly. Keep breathing normally as you execute this contraction.",
      "Hold for the recommended number of seconds.",
      "Now release the tension slowly.",
      "Rest for the recommended amount of time and repeat."
    ],
    "category": "plyometrics",
    "id": "Isometric_Chest_Squeezes",
    "original_name": "Isometric Chest Squeezes",
    "app_category": "chest"
  },
  {
    "name": "Isometric Wipers",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Assume a push-up position, supporting your weight on your hands and toes while keeping your body straight. Your hands should be just outside of shoulder width. This will be your starting position.",
      "Begin by shifting your body weight as far to one side as possible, allowing the elbow on that side to flex as you lower your body.",
      "Reverse the motion by extending the flexed arm, pushing yourself up and then dropping to the other side.",
      "Repeat for the desired number of repetitions."
    ],
    "category": "strength",
    "id": "Isometric_Wipers",
    "original_name": "Isometric Wipers",
    "app_category": "chest"
  },
  {
    "name": "One Arm Dumbbell Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie down on a flat bench with a dumbbell in one hand on top of your thigh.",
      "By using your thigh to help you get the dumbbell up, clean the dumbbell up so that you can hold it in front of you at shoulder width. Use the hand you are not lifting with to help position the dumbbell over you properly.",
      "Once at shoulder width, rotate your wrist forward so that the palm of your hand is facing away from you. This will be your starting position.",
      "Bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbell at all times. Tip: Use the hand that you are not lifting with to help keep the dumbbell balance as you may struggle a bit at first. Only use your non-lifting hand if it is needed. Otherwise, keep it resting to the side.",
      "As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.",
      "Repeat the movement for the prescribed amount of repetitions of your training program.",
      "Switch arms and repeat the movement."
    ],
    "category": "strength",
    "id": "One_Arm_Dumbbell_Bench_Press",
    "original_name": "One Arm Dumbbell Bench Press",
    "app_category": "chest"
  },
  {
    "name": "One-Arm Flat Bench Dumbbell Flye",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie down on a flat bench with a dumbbell in one hand resting on top of your thigh. The palm of your hand with the dumbbell in it should be at a neutral grip.",
      "By using your thighs to help you get the dumbbell up, clean the dumbbell so that you can hold it in front of you with your lifting arm being fully extended. Remember to maintain a neutral grip with this exercise. Your non lifting hand should be to the side holding the flat bench for better support. This will be your starting position.",
      "Your arm with the weight should have a slight bend on your elbow in order to prevent stress at the biceps tendon. Begin by lowering your arm with the weight in it out in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, your lifting arm should remain stationary; the movement should only occur at the shoulder joint.",
      "Return your lifting arm back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.",
      "Hold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions.",
      "Switch arms and repeat the exercise."
    ],
    "category": "strength",
    "id": "One-Arm_Flat_Bench_Dumbbell_Flye",
    "original_name": "One-Arm Flat Bench Dumbbell Flye",
    "app_category": "chest"
  },
  {
    "name": "Plyo Push-up",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Move into a prone position on the floor, supporting your weight on your hands and toes.",
      "Your arms should be fully extended with the hands around shoulder width. Keep your body straight throughout the movement. This will be your starting position.",
      "Descend by flexing at the elbow, lowering your chest towards the ground.",
      "At the bottom, reverse the motion by pushing yourself up through elbow extension as quickly as possible. Attempt to push your upper body up until your hands leave the ground.",
      "Return to the starting position and repeat the exercise.",
      "For added difficulty, add claps into the movement while you are air borne."
    ],
    "category": "plyometrics",
    "id": "Plyo_Push-up",
    "original_name": "Plyo Push-up",
    "app_category": "chest"
  },
  {
    "name": "Push Up to Side Plank",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Get into pushup position on the toes with your hands just outside of shoulder width.",
      "Perform a pushup by allowing the elbows to flex. As you descend, keep your body straight.",
      "Do one pushup and as you come up, shift your weight on the left side of the body, twist to the side while bringing the right arm up towards the ceiling in a side plank.",
      "Lower the arm back to the floor for another pushup and then twist to the other side.",
      "Repeat the series, alternating each side, for 10 or more reps."
    ],
    "category": "strength",
    "id": "Push_Up_to_Side_Plank",
    "original_name": "Push Up to Side Plank",
    "app_category": "chest"
  },
  {
    "name": "Push-Up Wide",
    "altNames": [],
    "force": null,
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "abdominals",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "With your hands wide apart, support your body on your toes and hands in a plank position. Your elbows should be extended and your body straight. Do not allow your hips to sag. This will be your starting position.",
      "To begin, allow the elbows to flex, lowering your chest to the floor as you inhale.",
      "Using your pectoral muscles, press your upper body back up to the starting position by extending the elbows. Exhale as you perform this step.",
      "After pausing at the contracted position, repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Push-Up_Wide",
    "original_name": "Push-Up Wide",
    "app_category": "chest"
  },
  {
    "name": "Push-Ups With Feet Elevated",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie on the floor face down and place your hands about 36 inches apart from each other holding your torso up at arms length.",
      "Place your toes on top of a flat bench. This will allow your body to be elevated. Note: The higher the elevation of the flat bench, the higher the resistance of the exercise is.",
      "Lower yourself until your chest almost touches the floor as you inhale.",
      "Using your pectoral muscles, press your upper body back up to the starting position and squeeze your chest. Breathe out as you perform this step.",
      "After a second pause at the contracted position, repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Push-Ups_With_Feet_Elevated",
    "original_name": "Push-Ups With Feet Elevated",
    "app_category": "chest"
  },
  {
    "name": "Push-ups",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "chest"
    ],
    "secondaryMuscles": [
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Lie on the floor face down and place your hands about 36 inches apart while holding your torso up at arms length.",
      "Next, lower yourself downward until your chest almost touches the floor as you inhale.",
      "Now breathe out and press your upper body back up to the starting position while squeezing your chest.",
      "After a brief pause at the top contracted position, you can begin to lower yourself downward again for as many repetitions as needed."
    ],
    "category": "strength",
    "id": "Pushups",
    "original_name": "Pushups",
    "app_category": "chest"
  },
  {
    "name": "3/4 Sit-Up",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie down on the floor and secure your feet. Your legs should be bent at the knees.",
      "Place your hands behind or to the side of your head. You will begin with your back on the ground. This will be your starting position.",
      "Flex your hips and spine to raise your torso toward your knees.",
      "At the top of the contraction your torso should be perpendicular to the ground. Reverse the motion, going only ¾ of the way down.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "3_4_Sit-Up",
    "original_name": "3/4 Sit-Up",
    "app_category": "core"
  },
  {
    "name": "Air Bike",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie flat on the floor with your lower back pressed to the ground. For this exercise, you will need to put your hands beside your head. Be careful however to not strain with the neck as you perform it. Now lift your shoulders into the crunch position.",
      "Bring knees up to where they are perpendicular to the floor, with your lower legs parallel to the floor. This will be your starting position.",
      "Now simultaneously, slowly go through a cycle pedal motion kicking forward with the right leg and bringing in the knee of the left leg. Bring your right elbow close to your left knee by crunching to the side, as you breathe out.",
      "Go back to the initial position as you breathe in.",
      "Crunch to the opposite side as you cycle your legs and bring closer your left elbow to your right knee and exhale.",
      "Continue alternating in this manner until all of the recommended repetitions for each side have been completed."
    ],
    "category": "strength",
    "id": "Air_Bike",
    "original_name": "Air Bike",
    "app_category": "core"
  },
  {
    "name": "Barbell Side Bend",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "lower back"
    ],
    "instructions": [
      "Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck). Your feet should be shoulder width apart. This will be your starting position.",
      "While keeping your back straight and your head up, bend only at the waist to the right as far as possible. Breathe in as you bend to the side. Then hold for a second and come back up to the starting position as you exhale. Tip: Keep the rest of the body stationary.",
      "Now repeat the movement but bending to the left instead. Hold for a second and come back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Side_Bend",
    "original_name": "Barbell Side Bend",
    "app_category": "core"
  },
  {
    "name": "Bottoms Up",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Begin by lying on your back on the ground. Your legs should be straight and your arms at your side. This will be your starting position.",
      "To perform the movement, tuck the knees toward your chest by flexing the hips and knees. Following this, extend your legs directly above you so that they are perpendicular to the ground. Rotate and elevate your pelvis to raise your glutes from the floor.",
      "After a brief pause, return to the starting position."
    ],
    "category": "strength",
    "id": "Bottoms_Up",
    "original_name": "Bottoms Up",
    "app_category": "core"
  },
  {
    "name": "Butt-Ups",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Begin a pushup position but with your elbows on the ground and resting on your forearms. Your arms should be bent at a 90 degree angle.",
      "Arch your back slightly out rather than keeping your back completely straight.",
      "Raise your glutes toward the ceiling, squeezing your abs tightly to close the distance between your ribcage and hips. The end result will be that you'll end up in a high bridge position. Exhale as you perform this portion of the movement.",
      "Lower back down slowly to your starting position as you breathe in. Tip: Don't let your back sag downwards.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Butt-Ups",
    "original_name": "Butt-Ups",
    "app_category": "core"
  },
  {
    "name": "Cable Crunch",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Kneel below a high pulley that contains a rope attachment.",
      "Grasp cable rope attachment and lower the rope until your hands are placed next to your face.",
      "Flex your hips slightly and allow the weight to hyperextend the lower back. This will be your starting position.",
      "With the hips stationary, flex the waist as you contract the abs so that the elbows travel towards the middle of the thighs. Exhale as you perform this portion of the movement and hold the contraction for a second.",
      "Slowly return to the starting position as you inhale. Tip: Make sure that you keep constant tension on the abs throughout the movement. Also, do not choose a weight so heavy that the lower back handles the brunt of the work.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Cable_Crunch",
    "original_name": "Cable Crunch",
    "app_category": "core"
  },
  {
    "name": "Cable Judo Flip",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Connect a rope attachment to a tower, and move the cable to the lowest pulley position. Stand with your side to the cable with a wide stance, and grab the rope with both hands.",
      "Twist your body away from the pulley as you bring the rope over your shoulder like you're performing a judo flip.",
      "Shift your weight between your feet as you twist and crunch forward, pulling the cable downward.",
      "Return to the starting position and repeat until failure.",
      "Then, reposition and repeat the same series of movements on the opposite side."
    ],
    "category": "strength",
    "id": "Cable_Judo_Flip",
    "original_name": "Cable Judo Flip",
    "app_category": "core"
  },
  {
    "name": "Cable Pallof Press",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders",
      "triceps"
    ],
    "instructions": [
      "Connect a standard handle to a tower, and—if possible—position the cable to shoulder height. If not, a low pulley will suffice.",
      "With your side to the cable, grab the handle with both hands and step away from the tower. You should be approximately arm's length away from the pulley, with the tension of the weight on the cable.",
      "With your feet positioned hip-width apart and knees slightly bent, hold the cable to the middle of your chest. This will be your starting position.",
      "Press the cable away from your chest, fully extending both arms. You core should be tight and engaged.",
      "Hold the repetition for several seconds before returning to the starting position.",
      "At the conclusion of the set, repeat facing the other direction."
    ],
    "category": "strength",
    "id": "Pallof_Press",
    "original_name": "Pallof Press",
    "app_category": "core"
  },
  {
    "name": "Cable Seated Crunch",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Seat on a flat bench with your back facing a high pulley.",
      "Grasp the cable rope attachment with both hands (with the palms of the hands facing each other) and place your hands securely over both shoulders. Tip: Allow the weight to hyperextend the lower back slightly. This will be your starting position.",
      "With the hips stationary, flex the waist so the elbows travel toward the hips. Breathe out as you perform this step.",
      "As you inhale, go back to the initial position slowly.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Cable_Seated_Crunch",
    "original_name": "Cable Seated Crunch",
    "app_category": "core"
  },
  {
    "name": "Cocoons",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Begin by lying on your back on the ground. Your legs should be straight and your arms extended behind your head. This will be your starting position.",
      "To perform the movement, tuck the knees toward your chest, rotating your pelvis to lift your glutes from the floor. As you do so, flex the spine, bringing your arms back over your head to perform a simultaneous crunch motion.",
      "After a brief pause, return to the starting position."
    ],
    "category": "strength",
    "id": "Cocoons",
    "original_name": "Cocoons",
    "app_category": "core"
  },
  {
    "name": "Crunches",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie flat on your back with your feet flat on the ground, or resting on a bench with your knees bent at a 90 degree angle. If you are resting your feet on a bench, place them three to four inches apart and point your toes inward so they touch.",
      "Now place your hands lightly on either side of your head keeping your elbows in. Tip: Don't lock your fingers behind your head.",
      "While pushing the small of your back down in the floor to better isolate your abdominal muscles, begin to roll your shoulders off the floor.",
      "Continue to push down as hard as you can with your lower back as you contract your abdominals and exhale. Your shoulders should come up off the floor only about four inches, and your lower back should remain on the floor. At the top of the movement, contract your abdominals hard and keep the contraction for a second. Tip: Focus on slow, controlled movement - don't cheat yourself by using momentum.",
      "After the one second contraction, begin to come down slowly again to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Crunches",
    "original_name": "Crunches",
    "app_category": "core"
  },
  {
    "name": "Dead Bug",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Begin lying on your back with your hands extended above you toward the ceiling.",
      "Bring your feet, knees, and hips up to 90 degrees.",
      "Exhale hard to bring your ribcage down and flatten your back onto the floor, rotating your pelvis up and squeezing your glutes. Hold this position throughout the movement. This will be your starting position.",
      "Initiate the exercise by extending one leg, straightening the knee and hip to bring the leg just above the ground.",
      "Maintain the position of your lumbar and pelvis as you perform the movement, as your back is going to want to arch.",
      "Stay tight and return the working leg to the starting position.",
      "Repeat on the opposite side, alternating until the set is complete."
    ],
    "category": "strength",
    "id": "Dead_Bug",
    "original_name": "Dead Bug",
    "app_category": "core"
  },
  {
    "name": "Dumbbell Side Bend",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand up straight while holding a dumbbell on the left hand (palms facing the torso) as you have the right hand holding your waist. Your feet should be placed at shoulder width. This will be your starting position.",
      "While keeping your back straight and your head up, bend only at the waist to the right as far as possible. Breathe in as you bend to the side. Then hold for a second and come back up to the starting position as you exhale. Tip: Keep the rest of the body stationary.",
      "Now repeat the movement but bending to the left instead. Hold for a second and come back to the starting position.",
      "Repeat for the recommended amount of repetitions and then change hands."
    ],
    "category": "strength",
    "id": "Dumbbell_Side_Bend",
    "original_name": "Dumbbell Side Bend",
    "app_category": "core"
  },
  {
    "name": "Landmine 180's",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "glutes",
      "lower back",
      "shoulders"
    ],
    "instructions": [
      "Position a bar into a landmine or securely anchor it in a corner. Load the bar to an appropriate weight.",
      "Raise the bar from the floor, taking it to shoulder height with both hands with your arms extended in front of you. Adopt a wide stance. This will be your starting position.",
      "Perform the movement by rotating the trunk and hips as you swing the weight all the way down to one side. Keep your arms extended throughout the exercise.",
      "Reverse the motion to swing the weight all the way to the opposite side.",
      "Continue alternating the movement until the set is complete."
    ],
    "category": "strength",
    "id": "Landmine_180s",
    "original_name": "Landmine 180's",
    "app_category": "core"
  },
  {
    "name": "Overhead Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": null,
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "chest",
      "forearms",
      "lats",
      "triceps"
    ],
    "instructions": [
      "Standing straight up, lace your fingers together and open your palms to the ceiling. Keep your shoulders down as you extend your arms up.",
      "To create a full torso stretch, pull your tailbone down and stabilize your torso as you do this. Stretch the muscles on both the front and the back of the torso."
    ],
    "category": "stretching",
    "id": "Overhead_Stretch",
    "original_name": "Overhead Stretch",
    "app_category": "core"
  },
  {
    "name": "Plank",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Get into a prone position on the floor, supporting your weight on your toes and your forearms. Your arms are bent and directly below the shoulder.",
      "Keep your body straight at all times, and hold this position as long as possible. To increase difficulty, an arm or leg can be raised."
    ],
    "category": "strength",
    "id": "Plank",
    "original_name": "Plank",
    "app_category": "core"
  },
  {
    "name": "Rope Crunch",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Kneel 1-2 feet in front of a cable system with a rope attached.",
      "After selecting an appropriate weight, grasp the rope with both hands reaching overhead. Your torso should be upright in the starting position.",
      "To begin, flex at the spine, attempting to bring your rib cage to your legs as you pull the cable down.",
      "Pause at the bottom of the motion, and then slowly return to the starting position.",
      "These can be done with twists or to the side to hit the obliques."
    ],
    "category": "strength",
    "id": "Rope_Crunch",
    "original_name": "Rope Crunch",
    "app_category": "core"
  },
  {
    "name": "Seated Barbell Twist",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Start out by sitting at the end of a flat bench with a barbell placed on top of your thighs. Your feet should be shoulder width apart from each other.",
      "Grip the bar with your palms facing down and make sure your hands are wider than shoulder width apart from each other. Begin to lift the barbell up over your head until your arms are fully extended.",
      "Now lower the barbell behind your head until it is resting along the base of your neck. This is the starting position.",
      "While keeping your feet and head stationary, move your waist from side to side so that your oblique muscles feel the contraction. Only move from side to side as far as your waist will allow you to go. Stretching or moving too far can cause an injury to occur. Tip: Use a slow and controlled motion.",
      "Remember to breathe out while twisting your body to the side and in when moving back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Seated_Barbell_Twist",
    "original_name": "Seated Barbell Twist",
    "app_category": "core"
  },
  {
    "name": "Sit-Up",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie down on the floor placing your feet either under something that will not move or by having a partner hold them. Your legs should be bent at the knees.",
      "Place your hands behind your head and lock them together by clasping your fingers. This is the starting position.",
      "Elevate your upper body so that it creates an imaginary V-shape with your thighs. Breathe out when performing this part of the exercise.",
      "Once you feel the contraction for a second, lower your upper body back down to the starting position while inhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Sit-Up",
    "original_name": "Sit-Up",
    "app_category": "core"
  },
  {
    "name": "Spell Caster",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "glutes",
      "shoulders"
    ],
    "instructions": [
      "Hold a dumbbell in each hand with a pronated grip. Your feet should be wide with your hips and knees extended. This will be your starting position.",
      "Begin the movement by pulling both of the dumbbells to one side next to your hip, rotating your torso.",
      "Keeping your arms straight and the dumbbells parallel to the ground, rotate your torso to swing the weights to your opposite side.",
      "Continue alternating, rotating from one side to the other until the set is complete."
    ],
    "category": "strength",
    "id": "Spell_Caster",
    "original_name": "Spell Caster",
    "app_category": "core"
  },
  {
    "name": "Standing Cable Lift",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [
      "shoulders"
    ],
    "instructions": [
      "Connect a standard handle on a tower, and move the cable to the lowest pulley position.",
      "With your side to the cable, grab the handle with one hand and step away from the tower. You should be approximately arm's length away from the pulley, with the tension of the weight on the cable. Your outstretched arm should be aligned with the cable.",
      "With your feet positioned shoulder width apart, squat down and grab the handle with both hands. Your arms should still be fully extended.",
      "In one motion, pull the handle up and across your body until your arms are in a fully-extended position above your head.",
      "Keep your back straight and your arms close to your body as you pivot your back foot and straighten your legs to get a full range of motion.",
      "Retract your arms and then your body. Return to the neutral position in a slow and controlled manner.",
      "Repeat to failure.",
      "Then, reposition and repeat the same series of movements on the opposite side."
    ],
    "category": "strength",
    "id": "Standing_Cable_Lift",
    "original_name": "Standing Cable Lift",
    "app_category": "core"
  },
  {
    "name": "Torso Rotation",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": null,
    "equipment": "exercise ball",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand upright holding an exercise ball with both hands. Extend your arms so the ball is straight out in front of you. This will be your starting position.",
      "Rotate your torso to one side, keeping your eyes on the ball as you move. Now, rotate back to the opposite direction. Repeat for 10-20 repetitions."
    ],
    "category": "stretching",
    "id": "Torso_Rotation",
    "original_name": "Torso Rotation",
    "app_category": "core"
  },
  {
    "name": "Tuck Crunch",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "To begin, lie down on the floor or an exercise mat with your back pressed against the floor. Your arms should be lying across your sides with the palms facing down.",
      "Your legs should be crossed by wrapping one ankle around the other. Slowly elevate your legs up in the air until your thighs are perpendicular to the floor with a slight bend at the knees. Note: Your knees and toes should be parallel to the floor as opposed to the thighs.",
      "Move your arms from the floor and cross them so they are resting on your chest. This is the starting position.",
      "While keeping your lower back pressed against the floor, slowly lift your torso. Remember to exhale while perform this part of the exercise.",
      "Slowly begin to lower your torso back down to the starting position while inhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Tuck_Crunch",
    "original_name": "Tuck Crunch",
    "app_category": "core"
  },
  {
    "name": "Weighted Crunches",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "medicine ball",
    "primaryMuscles": [
      "abdominals"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie flat on your back with your feet flat on the ground or resting on a bench with your knees bent at a 90 degree angle.",
      "Hold a weight to your chest, or you may hold it extended above your torso. This will be your starting position.",
      "Now, exhale and slowly begin to roll your shoulders off the floor. Your shoulders should come up off the floor about 4 inches while your lower back remains on the floor.",
      "At the top of the movement, flex your abdominals and hold for a brief pause.",
      "Then inhale and slowly lower yourself back down to the starting position."
    ],
    "category": "strength",
    "id": "Weighted_Crunches",
    "original_name": "Weighted Crunches",
    "app_category": "core"
  },
  {
    "name": "Barbell Finger Curls",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "forearms"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width.",
      "Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. This will be your starting position.",
      "Lower the bar as far as possible by extending the fingers. Allowing the bar to roll down the hands, catch the bar with the final joint in the fingers.",
      "Now curl bar up as high as possible by closing your hands while exhaling. Hold the contraction at the top."
    ],
    "category": "strength",
    "id": "Finger_Curls",
    "original_name": "Finger Curls",
    "app_category": "forearms"
  },
  {
    "name": "Palms-Up Dumbbell Wrist Curl Over A Bench",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "forearms"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Start out by placing two dumbbells on one side of a flat bench.",
      "Kneel down on both of your knees so that your body is facing the flat bench.",
      "Use your arms to grab both of the dumbbells with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge.",
      "Start out by curling your wrist upwards and exhaling.",
      "Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise.",
      "Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Palms-Up_Dumbbell_Wrist_Curl_Over_A_Bench",
    "original_name": "Palms-Up Dumbbell Wrist Curl Over A Bench",
    "app_category": "forearms"
  },
  {
    "name": "Seated Dumbbell Palms-Down Wrist Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "forearms"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Start out by placing two dumbbells on the floor in front of a flat bench.",
      "Sit down on the edge of the flat bench with your legs at about shoulder width apart. Make sure to keep your feet on the floor.",
      "Use your arms to grab both of the dumbbells and bring them up so that your forearms are resting against your thighs with the palms of the hands facing down. Your wrists should be hanging over the edge of your thighs.",
      "Start out by curling your wrist upwards and exhaling.",
      "Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Tip: Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.",
      "Repeat for the recommended amount of repetitions.",
      "When finished, simply lower the dumbbells to the floor."
    ],
    "category": "strength",
    "id": "Seated_Dumbbell_Palms-Down_Wrist_Curl",
    "original_name": "Seated Dumbbell Palms-Down Wrist Curl",
    "app_category": "forearms"
  },
  {
    "name": "Seated Dumbbell Palms-Up Wrist Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "forearms"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Start out by placing two dumbbells on the floor in front of a flat bench.",
      "Sit down on the edge of the flat bench with your legs at about shoulder width apart. Make sure to keep your feet on the floor.",
      "Use your arms to grab both of the dumbbells and bring them up so that your forearms are resting against your thighs with the palms of the hands facing up. Your wrists should be hanging over the edge of your thighs.",
      "Start out by curling your wrist upwards and exhaling.",
      "Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Tip: Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.",
      "Repeat for the recommended amount of repetitions.",
      "When finished, simply lower the dumbbells to the floor."
    ],
    "category": "strength",
    "id": "Seated_Dumbbell_Palms-Up_Wrist_Curl",
    "original_name": "Seated Dumbbell Palms-Up Wrist Curl",
    "app_category": "forearms"
  },
  {
    "name": "Wrist Circles",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "forearms"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Start by standing straight with your feet being shoulder width apart from each other. Elevate your arms to the side of you until they are fully extended and parallel to the floor at a height that is evenly aligned with your shoulders. Tip: Your torso and arms should form the letter \"T: Your palms should be facing down. This is the starting position.",
      "Keeping your entire body stationary except for the wrists, begin to rotate both wrists forward in a circular motion. Tip: Pretend that you are trying to draw circles by using your hands as the brush. Breathe normally as you perform this exercise.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "stretching",
    "id": "Wrist_Circles",
    "original_name": "Wrist Circles",
    "app_category": "forearms"
  },
  {
    "name": "Ankle Circles",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Use a sturdy object like a squat rack to hold yourself.",
      "Lift the right leg in the air (just around 2 inches from the floor) and perform a circular motion with the big toe. Pretend that you are drawing a big circle with it. Tip: One circle equals 1 repetition. Breathe normally as you perform the movement.",
      "When you are done with the right foot, then repeat with the left leg."
    ],
    "category": "stretching",
    "id": "Ankle_Circles",
    "original_name": "Ankle Circles",
    "app_category": "legs_calf"
  },
  {
    "name": "Barbell Rocking Standing Calf Raise",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place it on the back of your shoulders (slightly below the neck).",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance. Also maintain a straight back and keep the knees with a slight bend; never locked. This will be your starting position.",
      "Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending (other than the slight initial bend we created during positioning) at any time. Hold the contracted position by a second before you start to go back down.",
      "Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.",
      "Now lift your toes by contracting the tibia muscles in the front of the calves as you breathe out.",
      "Hold for a second and bring them back down as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Rocking_Standing_Calf_Raise",
    "original_name": "Rocking Standing Calf Raise",
    "app_category": "legs_calf"
  },
  {
    "name": "Barbell Seated Calf Raise",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Place a block about 12 inches in front of a flat bench.",
      "Sit on the bench and place the ball of your feet on the block.",
      "Have someone place a barbell over your upper thighs about 3 inches above your knees and hold it there. This will be your starting position.",
      "Raise up on your toes as high as possible as you squeeze the calves and as you breathe out.",
      "After a second contraction, slowly go back to the starting position. Tip: To get maximum benefit stretch your calves as far as you can.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Seated_Calf_Raise",
    "original_name": "Barbell Seated Calf Raise",
    "app_category": "legs_calf"
  },
  {
    "name": "Dumbbell Seated One-Leg Calf Raise",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Place a block on the floor about 12 inches from a flat bench.",
      "Sit on a flat bench and place a dumbbell on your upper left thigh about 3 inches above your knee.",
      "Now place the ball of your left foot on the block. This will be your starting position.",
      "Raise your toes up as high as possible as you exhale and you contract your calf muscle. Hold the contraction for a second.",
      "Slowly return to the starting position, stretching as far down as possible.",
      "Repeat for your prescribed number of repetitions and then repeat with the right leg."
    ],
    "category": "strength",
    "id": "Dumbbell_Seated_One-Leg_Calf_Raise",
    "original_name": "Dumbbell Seated One-Leg Calf Raise",
    "app_category": "legs_calf"
  },
  {
    "name": "Knee Circles",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Stand with your legs together and hands by your waist.",
      "Now move your knees in a circular motion as you breathe normally.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "stretching",
    "id": "Knee_Circles",
    "original_name": "Knee Circles",
    "app_category": "legs_calf"
  },
  {
    "name": "Machine Calf Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "machine",
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Adjust the seat so that your legs are only slightly bent in the start position. The balls of your feet should be firmly on the platform.",
      "Select an appropriate weight, and grasp the handles. This will be your starting position.",
      "Straighten the legs by extending the knees, just barely lifting the weight from the stack. Your ankle should be fully flexed, toes pointing up. Execute the movement by pressing downward through the balls of your feet as far as possible.",
      "After a brief pause, reverse the motion and repeat."
    ],
    "category": "strength",
    "id": "Calf_Press",
    "original_name": "Calf Press",
    "app_category": "legs_calf"
  },
  {
    "name": "Seated Calf Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Sit up straight on an exercise mat.",
      "Bend one knee and put that foot on the floor to stabilize the torso.",
      "Straighten your other leg and flex your ankle.",
      "Using a band, towel, or your hand if you can reach, pull the toes toward you. Hold for 10 to 20 seconds, then switch sides."
    ],
    "category": "stretching",
    "id": "Seated_Calf_Stretch",
    "original_name": "Seated Calf Stretch",
    "app_category": "legs_calf"
  },
  {
    "name": "Standing Barbell Calf Raise",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "calves"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the bar on the back of your shoulders (slightly below the neck).",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. The knees should be kept with a slight bend; never locked. This will be your starting position. Tip: For better range of motion you may also place the ball of your feet on a wooden block but be careful as this option requires more balance and a sturdy block.",
      "Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down.",
      "Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Standing_Barbell_Calf_Raise",
    "original_name": "Standing Barbell Calf Raise",
    "app_category": "legs_calf"
  },
  {
    "name": "Ankle On The Knee",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "From a lying position, bend your knees and keep your feet on the floor.",
      "Place your ankle of one foot on your opposite knee.",
      "Grasp the thigh or knee of the bottom leg and pull both of your legs into the chest. Relax your neck and shoulders. Hold for 10-20 seconds and then switch sides."
    ],
    "category": "stretching",
    "id": "Ankle_On_The_Knee",
    "original_name": "Ankle On The Knee",
    "app_category": "legs_glute"
  },
  {
    "name": "Butt Lift (Bridge)",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "Lie flat on the floor on your back with the hands by your side and your knees bent. Your feet should be placed around shoulder width. This will be your starting position.",
      "Pushing mainly with your heels, lift your hips off the floor while keeping your back straight. Breathe out as you perform this part of the motion and hold at the top for a second.",
      "Slowly go back to the starting position as you breathe in."
    ],
    "category": "strength",
    "id": "Butt_Lift_Bridge",
    "original_name": "Butt Lift (Bridge)",
    "app_category": "legs_glute"
  },
  {
    "name": "Flutter Kicks",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "On a flat bench lie facedown with the hips on the edge of the bench, the legs straight with toes high off the floor and with the arms on top of the bench holding on to the front edge.",
      "Squeeze your glutes and hamstrings and straighten the legs until they are level with the hips. This will be your starting position.",
      "Start the movement by lifting the left leg higher than the right leg.",
      "Then lower the left leg as you lift the right leg.",
      "Continue alternating in this manner (as though you are doing a flutter kick in water) until you have done the recommended amount of repetitions for each leg. Make sure that you keep a controlled movement at all times. Tip: You will breathe normally as you perform this movement."
    ],
    "category": "strength",
    "id": "Flutter_Kicks",
    "original_name": "Flutter Kicks",
    "app_category": "legs_glute"
  },
  {
    "name": "Glute Kickback",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "Kneel on the floor or an exercise mat and bend at the waist with your arms extended in front of you (perpendicular to the torso) in order to get into a kneeling push-up position but with the arms spaced at shoulder width. Your head should be looking forward and the bend of the knees should create a 90-degree angle between the hamstrings and the calves. This will be your starting position.",
      "As you exhale, lift up your right leg until the hamstrings are in line with the back while maintaining the 90-degree angle bend. Contract the glutes throughout this movement and hold the contraction at the top for a second. Tip: At the end of the movement the upper leg should be parallel to the floor while the calf should be perpendicular to it.",
      "Go back to the initial position as you inhale and now repeat with the left leg.",
      "Continue to alternate legs until all of the recommended repetitions have been performed."
    ],
    "category": "strength",
    "id": "Glute_Kickback",
    "original_name": "Glute Kickback",
    "app_category": "legs_glute"
  },
  {
    "name": "Knee Across The Body",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "abductors",
      "lower back"
    ],
    "instructions": [
      "Lie down on the floor with your right leg straight. Bend your left leg and lower it across your body, holding the knee down toward the floor with your right hand. (The knee doesn't need to touch the floor if you're tight.)",
      "Place your left arm comfortably beside you and turn your head to the left. Imagine you have a weight tied to your tailbone. let your tailbone fall back toward the floor as your chest reaches in the opposite direction to stretch your lower back. Switch sides."
    ],
    "category": "stretching",
    "id": "Knee_Across_The_Body",
    "original_name": "Knee Across The Body",
    "app_category": "legs_glute"
  },
  {
    "name": "Leg Lift",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "While standing up straight with both feet next to each other at around shoulder width, grab a sturdy surface such as the sides of a squat rack or the top of a chair to brace yourself and keep balance.",
      "With or without an ankle weight, lift one leg behind you as if performing a leg curl but standing up while keeping the other leg straight. Breathe out as you perform this movement.",
      "Slowly bring the raised leg back to the floor as you breathe in.",
      "Repeat for the recommended amount of repetitions.",
      "Repeat the movement with the opposite leg."
    ],
    "category": "strength",
    "id": "Leg_Lift",
    "original_name": "Leg Lift",
    "app_category": "legs_glute"
  },
  {
    "name": "One Knee To Chest",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": null,
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Start off by lying on the floor.",
      "Extend one leg straight and pull the other knee to your chest. Hold under the knee joint to protect the kneecap.",
      "Gently tug that knee toward your nose.",
      "Switch sides. This stretches the buttocks and lower back of the bent leg and the hip flexor of the straight leg."
    ],
    "category": "stretching",
    "id": "One_Knee_To_Chest",
    "original_name": "One Knee To Chest",
    "app_category": "legs_glute"
  },
  {
    "name": "Physioball Hip Bridge",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "exercise ball",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "Lay on a ball so that your upper back is on the ball with your hips unsupported. Both feet should be flat on the floor, hip width apart or wider. This will be your starting position.",
      "Begin by extending the hips using your glutes and hamstrings, raising your hips upward as you bridge.",
      "Pause at the top of the motion and return to the starting position."
    ],
    "category": "strength",
    "id": "Physioball_Hip_Bridge",
    "original_name": "Physioball Hip Bridge",
    "app_category": "legs_glute"
  },
  {
    "name": "Pull Through",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Begin standing a few feet in front of a low pulley with a rope or handle attached. Face away from the machine, straddling the cable, with your feet set wide apart.",
      "Begin the movement by reaching through your legs as far as possible, bending at the hips. Keep your knees slightly bent. Keeping your arms straight, extend through the hip to stand straight up. Avoid pulling upward through the shoulders; all of the motion should originate through the hips."
    ],
    "category": "strength",
    "id": "Pull_Through",
    "original_name": "Pull Through",
    "app_category": "legs_glute"
  },
  {
    "name": "Single Leg Glute Bridge",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "glutes"
    ],
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "Lay on the floor with your feet flat and knees bent.",
      "Raise one leg off of the ground, pulling the knee to your chest. This will be your starting position.",
      "Execute the movement by driving through the heel, extending your hip upward and raising your glutes off of the ground.",
      "Extend as far as possible, pause and then return to the starting position."
    ],
    "category": "strength",
    "id": "Single_Leg_Glute_Bridge",
    "original_name": "Single Leg Glute Bridge",
    "app_category": "legs_glute"
  },
  {
    "name": "90/90 Hamstring",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": null,
    "equipment": "body only",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves"
    ],
    "instructions": [
      "Lie on your back, with one leg extended straight out.",
      "With the other leg, bend the hip and knee to 90 degrees. You may brace your leg with your hands if necessary. This will be your starting position.",
      "Extend your leg straight into the air, pausing briefly at the top. Return the leg to the starting position.",
      "Repeat for 10-20 repetitions, and then switch to the other leg."
    ],
    "category": "stretching",
    "id": "90_90_Hamstring",
    "original_name": "90/90 Hamstring",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Front Leg Raises",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": null,
    "equipment": "body only",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand next to a chair or other support, holding on with one hand.",
      "Swing your leg forward, keeping the leg straight. Continue with a downward swing, bringing the leg as far back as your flexibility allows. Repeat 5-10 times, and then switch legs."
    ],
    "category": "stretching",
    "id": "Front_Leg_Raises",
    "original_name": "Front Leg Raises",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Hamstring Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie on your back with one leg extended above you, with the hip at ninety degrees. Keep the other leg flat on the floor.",
      "Loop a belt, band, or rope over the ball of your foot. This will be your starting position.",
      "Pull on the belt to create tension in the calves and hamstrings. Hold this stretch for 10-30 seconds, and repeat with the other leg."
    ],
    "category": "stretching",
    "id": "Hamstring_Stretch",
    "original_name": "Hamstring Stretch",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Hamstring-SMR",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "foam roll",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "In a seated position, extend your legs over a foam roll so that it is position on the back of the upper legs. Place your hands to the side or behind you to help support your weight. This will be your starting position.",
      "Using your hands, lift your hips off of the floor and shift your weight on the foam roll to one leg. Relax the hamstrings of the leg you are stretching.",
      "Roll over the foam from below the hip to above the back of the knee, pausing at points of tension for 10-30 seconds. Repeat for the other leg."
    ],
    "category": "stretching",
    "id": "Hamstring-SMR",
    "original_name": "Hamstring-SMR",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Inchworm",
    "altNames": [],
    "force": null,
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand with your feet close together. Keeping your legs straight, stretch down and put your hands on the floor directly in front of you. This will be your starting position.",
      "Begin by walking your hands forward slowly, alternating your left and your right. As you do so, bend only at the hip, keeping your legs straight.",
      "Keep going until your body is parallel to the ground in a pushup position.",
      "Now, keep your hands in place and slowly take short steps with your feet, moving only a few inches at a time.",
      "Continue walking until your feet are by hour hands, keeping your legs straight as you do so."
    ],
    "category": "stretching",
    "id": "Inchworm",
    "original_name": "Inchworm",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Knee Tuck Jump",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "quadriceps"
    ],
    "instructions": [
      "Begin in a comfortable standing position with your knees slightly bent. Hold your hands in front of you, palms down with your fingertips together at chest height. This will be your starting position.",
      "Rapidly dip down into a quarter squat and immediately explode upward. Drive the knees towards the chest, attempting to touch them to the palms of the hands.",
      "Jump as high as you can, raising your knees up, and then ensure a good land be re-extending your legs, absorbing impact through be allowing the knees to rebend."
    ],
    "category": "plyometrics",
    "id": "Knee_Tuck_Jump",
    "original_name": "Knee Tuck Jump",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Machine Seated Leg Curl",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "machine",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Adjust the machine lever to fit your height and sit on the machine with your back against the back support pad.",
      "Place the back of lower leg on top of padded lever (just a few inches under the calves) and secure the lap pad against your thighs, just above the knees. Then grasp the side handles on the machine as you point your toes straight (or you can also use any of the other two stances) and ensure that the legs are fully straight right in front of you. This will be your starting position.",
      "As you exhale, pull the machine lever as far as possible to the back of your thighs by flexing at the knees. Keep your torso stationary at all times. Hold the contracted position for a second.",
      "Slowly return to the starting position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Seated_Leg_Curl",
    "original_name": "Seated Leg Curl",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Moving Claw Series",
    "altNames": [],
    "force": null,
    "level": "beginner",
    "mechanic": "compound",
    "equipment": null,
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves",
      "quadriceps"
    ],
    "instructions": [
      "This move helps prepare your running form to help you excel at sprinting. As you run, be sure to flex the knee, aiming to kick your glutes as the hip extends.",
      "Reload the quad as the leg moves back forward, attacking the ground on the next step.",
      "Ensure that as you run, you block with the arms, punching through in a rapid 1-2 motion."
    ],
    "category": "plyometrics",
    "id": "Moving_Claw_Series",
    "original_name": "Moving Claw Series",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Prone Manual Hamstring",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "You will need a partner for this exercise. Lay face down with your legs straight. Your assistant will place their hand on your heel.",
      "To begin, flex the knee to curl your leg up. Your partner should provide resistance, starting light and increasing the pressure as the movement is completed. Communicate with your partner to monitor appropriate resistance levels.",
      "Pause at the top, returning the leg to the starting position as your partner provides resistance going the other direction."
    ],
    "category": "strength",
    "id": "Prone_Manual_Hamstring",
    "original_name": "Prone Manual Hamstring",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Runner's Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves"
    ],
    "instructions": [
      "It's easiest to get into this stretch if you start standing up, put one leg behind you, and slowly lower your torso down to the floor.",
      "Keep the front heel on the floor (if it lifts up, scoot your other leg further back).",
      "Place your hands on either side of your front leg. To get more out of this stretch, push your butt up toward the ceiling, and then gradually lower it back toward the floor. You'll Stretch the hip flexor of the back leg and the hamstring and buttocks of the front."
    ],
    "category": "stretching",
    "id": "Runners_Stretch",
    "original_name": "Runner's Stretch",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Standing Toe Touches",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "calves"
    ],
    "instructions": [
      "Stand with some space in front and behind you.",
      "Bend at the waist, keeping your legs straight, until you can relax and let your upper body hang down in front of you. Let your arms and hands hang down naturally. Hold for 10 to 20 seconds."
    ],
    "category": "stretching",
    "id": "Standing_Toe_Touches",
    "original_name": "Standing Toe Touches",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Stiff-Legged Dumbbell Deadlift",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "glutes",
      "lower back"
    ],
    "instructions": [
      "Grasp a couple of dumbbells holding them by your side at arm's length.",
      "Stand with your torso straight and your legs spaced using a shoulder width or narrower stance. The knees should be slightly bent. This is your starting position.",
      "Keeping the knees stationary, lower the dumbbells to over the top of your feet by bending at the waist while keeping your back straight. Keep moving forward as if you were going to pick something from the floor until you feel a stretch on the hamstrings. Exhale as you perform this movement",
      "Start bringing your torso up straight again by extending your hips and waist until you are back at the starting position. Inhale as you perform this movement.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Stiff-Legged_Dumbbell_Deadlift",
    "original_name": "Stiff-Legged Dumbbell Deadlift",
    "app_category": "legs_hamstring"
  },
  {
    "name": "The Straddle",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "adductors",
      "calves"
    ],
    "instructions": [
      "Begin in a seated, upright position. Start by extending your legs in front of you in a V.",
      "With your hands on the floor, lean forward as far as possible. Hold for 10 to 20 seconds."
    ],
    "category": "stretching",
    "id": "The_Straddle",
    "original_name": "The Straddle",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Upper Back-Leg Grab",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "lower back",
      "middle back"
    ],
    "instructions": [
      "While seated, bend forward to hug your thighs from underneath with both arms.",
      "Keep your knees together and your legs extended out as you bring your chest down to your knees. You can also stretch your middle back by pulling your back away from your knees as your hugging them."
    ],
    "category": "stretching",
    "id": "Upper_Back-Leg_Grab",
    "original_name": "Upper Back-Leg Grab",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Vertical Swing",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "hamstrings"
    ],
    "secondaryMuscles": [
      "glutes",
      "quadriceps",
      "shoulders"
    ],
    "instructions": [
      "Allow the dumbbell to hang at arms length between your legs, holding it with both hands. Keep your back straight and your head up.",
      "Swing the dumbbell between your legs, flexing at the hips and bending the knees slightly.",
      "Powerfully reverse the motion by extending at the hips, knees, and ankles to propel yourself upward, swinging the dumbell over your head.",
      "As you land, absorb the impact through your legs and draw the dumbbell to your torso before the next repetition."
    ],
    "category": "plyometrics",
    "id": "Vertical_Swing",
    "original_name": "Vertical Swing",
    "app_category": "legs_hamstring"
  },
  {
    "name": "Barbell Back Squat",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack to just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.",
      "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.",
      "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).",
      "Begin to slowly lower the bar by bending the knees and hips as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Squat",
    "original_name": "Barbell Squat",
    "app_category": "legs_quad"
  },
  {
    "name": "Barbell Side Split Squat",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck). Your feet should be placed wide apart with the foot of the lead leg angled out to the side. This will be your starting position.",
      "Lower your body towards the side of your angled foot by bending the knee and hip of your lead leg and while keeping the opposite leg only slightly bent. Breathe in as you lower your body.",
      "Return to the starting position by extending the hip and knee of the lead leg. Breathe out as you perform this movement.",
      "After performing the recommended amount of reps, repeat the movement with the opposite leg."
    ],
    "category": "strength",
    "id": "Barbell_Side_Split_Squat",
    "original_name": "Barbell Side Split Squat",
    "app_category": "legs_quad"
  },
  {
    "name": "Barbell Walking Lunge",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Begin standing with your feet shoulder width apart and a barbell across your upper back.",
      "Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot.",
      "Drive through the heel of your lead foot and extend both knees to raise yourself back up.",
      "Step forward with your rear foot, repeating the lunge on the opposite leg."
    ],
    "category": "strength",
    "id": "Barbell_Walking_Lunge",
    "original_name": "Barbell Walking Lunge",
    "app_category": "legs_quad"
  },
  {
    "name": "Bodyweight Squat",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand with your feet shoulder width apart. You can place your hands behind your head. This will be your starting position.",
      "Begin the movement by flexing your knees and hips, sitting back with your hips.",
      "Continue down to full depth if you are able,and quickly reverse the motion until you return to the starting position. As you squat, keep your head and chest up and push your knees out."
    ],
    "category": "strength",
    "id": "Bodyweight_Squat",
    "original_name": "Bodyweight Squat",
    "app_category": "legs_quad"
  },
  {
    "name": "Cable Deadlifts",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "cable",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "forearms",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Move the cables to the bottom of the towers and select an appropriate weight. Stand directly in between the uprights.",
      "To begin, squat down be flexing your hips and knees until you can reach the handles.",
      "After grasping them, begin your ascent. Driving through your heels extend your hips and knees keeping your hands hanging at your side. Keep your head and chest up throughout the movement.",
      "After reaching a full standing position, Return to the starting position and repeat."
    ],
    "category": "strength",
    "id": "Cable_Deadlifts",
    "original_name": "Cable Deadlifts",
    "app_category": "legs_quad"
  },
  {
    "name": "Double Leg Butt Kick",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "adductors",
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Begin standing with your knees slightly bent.",
      "Quickly squat a short distance, flexing the hips and knees, and immediately extend to jump for maximum vertical height.",
      "As you go up, tuck your heels by flexing the knees, attempting to touch the buttocks.",
      "Finish the motion by landing with the knees only partially bent, using your legs to absorb the impact."
    ],
    "category": "plyometrics",
    "id": "Double_Leg_Butt_Kick",
    "original_name": "Double Leg Butt Kick",
    "app_category": "legs_quad"
  },
  {
    "name": "Dumbbell Lunges",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.",
      "Step forward with your right leg around 2 feet or so from the foot being left stationary behind and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground.",
      "Using mainly the heel of your foot, push up and go back to the starting position as you exhale.",
      "Repeat the movement for the recommended amount of repetitions and then perform with the left leg."
    ],
    "category": "strength",
    "id": "Dumbbell_Lunges",
    "original_name": "Dumbbell Lunges",
    "app_category": "legs_quad"
  },
  {
    "name": "Dumbbell Squat",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "lower back"
    ],
    "instructions": [
      "Stand up straight while holding a dumbbell on each hand (palms facing the side of your legs).",
      "Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section.",
      "Begin to slowly lower your torso by bending the knees as you maintain a straight posture with the head up. Continue down until your thighs are parallel to the floor. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.",
      "Begin to raise your torso as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Dumbbell_Squat",
    "original_name": "Dumbbell Squat",
    "app_category": "legs_quad"
  },
  {
    "name": "Jogging, Treadmill",
    "altNames": [],
    "force": null,
    "level": "beginner",
    "mechanic": null,
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.",
      "Treadmills offer convenience, cardiovascular benefits, and usually have less impact than jogging outside. A 150 lb person will burn almost 250 calories jogging for 30 minutes, compared to more than 450 calories running. Maintain proper posture as you jog, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."
    ],
    "category": "cardio",
    "id": "Jogging_Treadmill",
    "original_name": "Jogging, Treadmill",
    "app_category": "legs_quad"
  },
  {
    "name": "Looking At Ceiling",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Kneel on the floor, holding your heels with both hands.",
      "Lift your buttocks up and forward while bringing your head back to look up at the ceiling, to give an arch in your back."
    ],
    "category": "stretching",
    "id": "Looking_At_Ceiling",
    "original_name": "Looking At Ceiling",
    "app_category": "legs_quad"
  },
  {
    "name": "Machine Leg Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).",
      "Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.",
      "As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.",
      "Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."
    ],
    "category": "strength",
    "id": "Leg_Press",
    "original_name": "Leg Press",
    "app_category": "legs_quad"
  },
  {
    "name": "Mountain Climbers",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": null,
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "chest",
      "hamstrings",
      "shoulders"
    ],
    "instructions": [
      "Begin in a pushup position, with your weight supported by your hands and toes. Flexing the knee and hip, bring one leg until the knee is approximately under the hip. This will be your starting position.",
      "Explosively reverse the positions of your legs, extending the bent leg until the leg is straight and supported by the toe, and bringing the other foot up with the hip and knee flexed. Repeat in an alternating fashion for 20-30 seconds."
    ],
    "category": "plyometrics",
    "id": "Mountain_Climbers",
    "original_name": "Mountain Climbers",
    "app_category": "legs_quad"
  },
  {
    "name": "One Half Locust",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "biceps",
      "chest"
    ],
    "instructions": [
      "Lie facedown on the floor.",
      "Put your left hand under your left hipbone to pad your hip and pubic bone.",
      "Bend your right knee so you can hold the foot in your right hand.",
      "Lift the foot in the air and simultaneously lift your shoulders off the floor. This also stretches the right hip flexor and the chest and shoulders. Switch sides. If it doesn't bother your back, you can try it with both arms and legs at the same time."
    ],
    "category": "stretching",
    "id": "One_Half_Locust",
    "original_name": "One Half Locust",
    "app_category": "legs_quad"
  },
  {
    "name": "Plie Dumbbell Squat",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abdominals",
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Hold a dumbbell at the base with both hands and stand straight up. Move your legs so that they are wider than shoulder width apart from each other with your knees slightly bent.",
      "Your toes should be facing out. Note: Your arms should be stationary while performing the exercise. This is the starting position.",
      "Slowly bend the knees and lower your legs until your thighs are parallel to the floor. Make sure to inhale as this is the eccentric part of the exercise.",
      "Press mainly with the heel of the foot to bring the body back to the starting position while exhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Plie_Dumbbell_Squat",
    "original_name": "Plie Dumbbell Squat",
    "app_category": "legs_quad"
  },
  {
    "name": "Rear Leg Raises",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": null,
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Place yourself on your hands knees on an exercise mat. Your head should be looking forward and the bend of the knees should create a 90-degree angle between the hamstrings and the calves. This will be your starting position.",
      "Extend one leg up and behind you. The knee and hip should both extend. Repeat for 5-10 repetitions, and then switch sides."
    ],
    "category": "stretching",
    "id": "Rear_Leg_Raises",
    "original_name": "Rear Leg Raises",
    "app_category": "legs_quad"
  },
  {
    "name": "Recumbent Bike",
    "altNames": [],
    "force": null,
    "level": "beginner",
    "mechanic": null,
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, seat yourself on the bike and adjust the seat to your height.",
      "Select the desired option from the menu. You may have to start pedaling to turn it on. You can use the manual setting, or you can select a program to use. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. The level of resistance can be changed throughout the workout. The handles can be used to monitor your heart rate to help you stay at an appropriate intensity.",
      "Recumbent bikes offer convenience, cardiovascular benefits, and have less impact than other activities. A 150 lb person will burn about 230 calories cycling at a moderate rate for 30 minutes, compared to 450 calories or more running."
    ],
    "category": "cardio",
    "id": "Recumbent_Bike",
    "original_name": "Recumbent Bike",
    "app_category": "legs_quad"
  },
  {
    "name": "Rocket Jump",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "hamstrings"
    ],
    "instructions": [
      "Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.",
      "To initiate the move, squat down halfway and explode back up as high as possible.",
      "Fully extend your entire body, reaching overhead as far as possible. As you land, absorb your impact through the legs."
    ],
    "category": "plyometrics",
    "id": "Rocket_Jump",
    "original_name": "Rocket Jump",
    "app_category": "legs_quad"
  },
  {
    "name": "Scissors Jump",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.",
      "Ensure that the front knee is over the midline of the foot. Extending through both legs, jump as high as possible, swinging your arms to gain lift.",
      "As you jump as high as you can, switch the position of your legs, moving your front leg to the back and the rear leg to the front.",
      "As you land, absorb the impact through the legs by adopting the lunge position, and repeat."
    ],
    "category": "plyometrics",
    "id": "Scissors_Jump",
    "original_name": "Scissors Jump",
    "app_category": "legs_quad"
  },
  {
    "name": "Single Leg Butt Kick",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "hamstrings"
    ],
    "instructions": [
      "Begin by standing on one leg, with the bent knee raised. This will be your start position.",
      "Using a countermovement jump, take off upward by extending the hip, knee, and ankle of the grounded leg.",
      "Immediately flex the knee and attempt to touch your butt with the heel of your jumping leg.",
      "Return the leg to a partially bent position underneath the hips and land. Your opposite leg should stay in relatively the same position throughout the drill."
    ],
    "category": "plyometrics",
    "id": "Single_Leg_Butt_Kick",
    "original_name": "Single Leg Butt Kick",
    "app_category": "legs_quad"
  },
  {
    "name": "Sit Squats",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "abductors",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Stand with your feet shoulder width apart. This will be your starting position.",
      "Begin the movement by flexing your knees and hips, sitting back with your hips.",
      "Continue until you have squatted a portion of the way down, but are above parallel, and quickly reverse the motion until you return to the starting position. Repeat for 5-10 repetitions."
    ],
    "category": "stretching",
    "id": "Sit_Squats",
    "original_name": "Sit Squats",
    "app_category": "legs_quad"
  },
  {
    "name": "Split Jump",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.",
      "Ensure that the front knee is over the midline of the foot.",
      "Extending through both legs, jump as high as possible, swinging your arms to gain lift.",
      "As you jump, bring your feet together, and move them back to their initial positions as you land.",
      "Absorb the impact by reverting back to the starting position."
    ],
    "category": "plyometrics",
    "id": "Split_Jump",
    "original_name": "Split Jump",
    "app_category": "legs_quad"
  },
  {
    "name": "Split Squat with Dumbbells",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "Position yourself into a staggered stance with the rear foot elevated and front foot forward.",
      "Hold a dumbbell in each hand, letting them hang at the sides. This will be your starting position.",
      "Begin by descending, flexing your knee and hip to lower your body down. Maintain good posture througout the movement. Keep the front knee in line with the foot as you perform the exercise.",
      "At the bottom of the movement, drive through the heel to extend the knee and hip to return to the starting position."
    ],
    "category": "strength",
    "id": "Split_Squat_with_Dumbbells",
    "original_name": "Split Squat with Dumbbells",
    "app_category": "legs_quad"
  },
  {
    "name": "Standing Long Jump",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "This drill is best done in sand or other soft landing surface. Ensure that you are able to measure distance. Stand in a partial squat stance with feet shoulder width apart.",
      "Utilizing a big arm swing and a countermovement of the legs, jump forward as far as you can.",
      "Attempt to land with your feet out in front you, reaching as far as possible with your legs.",
      "Measure the distance from your landing point to the starting point and track results."
    ],
    "category": "plyometrics",
    "id": "Standing_Long_Jump",
    "original_name": "Standing Long Jump",
    "app_category": "legs_quad"
  },
  {
    "name": "Star Jump",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings",
      "shoulders"
    ],
    "instructions": [
      "Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.",
      "To initiate the move, squat down halfway and explode back up as high as possible. Fully extend your entire body, spreading your legs and arms away from the body.",
      "As you land, bring your limbs back in and absorb your impact through the legs."
    ],
    "category": "plyometrics",
    "id": "Star_Jump",
    "original_name": "Star Jump",
    "app_category": "legs_quad"
  },
  {
    "name": "Walking, Treadmill",
    "altNames": [],
    "force": null,
    "level": "beginner",
    "mechanic": null,
    "equipment": "machine",
    "primaryMuscles": [
      "quadriceps"
    ],
    "secondaryMuscles": [
      "calves",
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.",
      "Treadmills offer convenience, cardiovascular benefits, and usually have less impact than walking outside. When walking, you should move at a moderate to fast pace, not a leisurely one. Being an activity of lower intensity, walking doesn't burn as many calories as some other activities, but still provides great benefit. A 150 lb person will burn about 175 calories walking 4 miles per hour for 30 minutes, compared to 450 calories running twice as fast. Maintain proper posture as you walk, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."
    ],
    "category": "cardio",
    "id": "Walking_Treadmill",
    "original_name": "Walking, Treadmill",
    "app_category": "legs_quad"
  },
  {
    "name": "Isometric Neck Exercise - Front And Back",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "neck"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "With your head and neck in a neutral position (normal position with head erect facing forward), place both of your hands on the front side of your head.",
      "Now gently push forward as you contract the neck muscles but resisting any movement of your head. Start with slow tension and increase slowly. Keep breathing normally as you execute this contraction.",
      "Hold for the recommended number of seconds.",
      "Now release the tension slowly.",
      "Rest for the recommended amount of time and repeat with your hands placed on the back side of your head."
    ],
    "category": "strength",
    "id": "Isometric_Neck_Exercise_-_Front_And_Back",
    "original_name": "Isometric Neck Exercise - Front And Back",
    "app_category": "other"
  },
  {
    "name": "Isometric Neck Exercise - Sides",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "neck"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "With your head and neck in a neutral position (normal position with head erect facing forward), place your left hand on the left side of your head.",
      "Now gently push towards the left as you contract the left neck muscles but resisting any movement of your head. Start with slow tension and increase slowly. Keep breathing normally as you execute this contraction.",
      "Hold for the recommended number of seconds.",
      "Now release the tension slowly.",
      "Rest for the recommended amount of time and repeat with your right hand placed on the right side of your head."
    ],
    "category": "strength",
    "id": "Isometric_Neck_Exercise_-_Sides",
    "original_name": "Isometric Neck Exercise - Sides",
    "app_category": "other"
  },
  {
    "name": "Lateral Bound",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [
      "abductors",
      "calves",
      "glutes",
      "hamstrings",
      "quadriceps"
    ],
    "instructions": [
      "Assume a half squat position facing 90 degrees from your direction of travel. This will be your starting position.",
      "Allow your lead leg to do a countermovement inward as you shift your weight to the outside leg.",
      "Immediately push off and extend, attempting to bound to the side as far as possible.",
      "Upon landing, immediately push off in the opposite direction, returning to your original start position.",
      "Continue back and forth for several repetitions."
    ],
    "category": "plyometrics",
    "id": "Lateral_Bound",
    "original_name": "Lateral Bound",
    "app_category": "other"
  },
  {
    "name": "Monster Walk",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "bands",
    "primaryMuscles": [
      "abductors"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Place a band around both ankles and another around both knees. There should be enough tension that they are tight when your feet are shoulder width apart.",
      "To begin, take short steps forward alternating your left and right foot.",
      "After several steps, do just the opposite and walk backward to where you started."
    ],
    "category": "strength",
    "id": "Monster_Walk",
    "original_name": "Monster Walk",
    "app_category": "other"
  },
  {
    "name": "Thigh Adductor",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "machine",
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [
      "glutes",
      "hamstrings"
    ],
    "instructions": [
      "To begin, sit down on the adductor machine and select a weight you are comfortable with. When your legs are positioned properly on the leg pads of the machine, grip the handles on each side. Your entire upper body (from the waist up) should be stationary. This is the starting position.",
      "Slowly press against the machine with your legs to move them towards each other while exhaling.",
      "Feel the contraction for a second and begin to move your legs back to the starting position while breathing in. Note: Remember to keep your upper body stationary and avoid fast jerking motions in order to prevent any injuries from occurring.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Thigh_Adductor",
    "original_name": "Thigh Adductor",
    "app_category": "other"
  },
  {
    "name": "Arm Circles",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "traps"
    ],
    "instructions": [
      "Stand up and extend your arms straight out by the sides. The arms should be parallel to the floor and perpendicular (90-degree angle) to your torso. This will be your starting position.",
      "Slowly start to make circles of about 1 foot in diameter with each outstretched arm. Breathe normally as you perform the movement.",
      "Continue the circular motion of the outstretched arms for about ten seconds. Then reverse the movement, going the opposite direction."
    ],
    "category": "stretching",
    "id": "Arm_Circles",
    "original_name": "Arm Circles",
    "app_category": "shoulders"
  },
  {
    "name": "Barbell Anti-Gravity Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "middle back",
      "traps",
      "triceps"
    ],
    "instructions": [
      "Place a bar on the ground behind the head of an incline bench.",
      "Lay on the bench face down. With a pronated grip, pick the barbell up from the floor. Flex the elbows, performing a reverse curl to bring the bar near your chest. This will be your starting position.",
      "To begin, press the barbell out in front of your head by extending your elbows. Keep your arms parallel to the ground throughout the movement.",
      "Return to the starting position and repeat to complete the set."
    ],
    "category": "strength",
    "id": "Anti-Gravity_Press",
    "original_name": "Anti-Gravity Press",
    "app_category": "shoulders"
  },
  {
    "name": "Barbell Bradford/Rocky Presses",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "triceps"
    ],
    "instructions": [
      "Sit on a Military Press Bench with a bar at shoulder level with a pronated grip (palms facing forward). Tip: Your grip should be wider than shoulder width and it should create a 90-degree angle between the forearm and the upper arm as the barbell goes down. This is your starting position.",
      "Once you pick up the barbell with the correct grip, lift the bar up over your head by locking your arms.",
      "Now lower the bar down to the back of the head slowly as you inhale.",
      "Lift the bar back up to the starting position as you exhale.",
      "Lower the bar down to the starting position slowly as you inhale. This is one repetition.",
      "Alternate in this manner until you complete the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Bradford_Rocky_Presses",
    "original_name": "Bradford/Rocky Presses",
    "app_category": "shoulders"
  },
  {
    "name": "Barbell Incline Shoulder Raise",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "chest"
    ],
    "instructions": [
      "Lie back on an Incline Bench. Using a medium width grip (a grip that is slightly wider than shoulder width), lift the bar from the rack and hold it straight over you with your arms straight. This will be your starting position.",
      "While keeping the arms straight, lift the bar by protracting your shoulder blades, raising the shoulders from the bench as you breathe out.",
      "Bring back the bar to the starting position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Incline_Shoulder_Raise",
    "original_name": "Barbell Incline Shoulder Raise",
    "app_category": "shoulders"
  },
  {
    "name": "Barbell Rear Delt Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "biceps",
      "lats",
      "middle back"
    ],
    "instructions": [
      "Stand up straight while holding a barbell using a wide (higher than shoulder width) and overhand (palms facing your body) grip.",
      "Bend knees slightly and bend over as you keep the natural arch of your back. Let the arms hang in front of you as they hold the bar. Once your torso is parallel to the floor, flare the elbows out and away from your body. Tip: Your torso and your arms should resemble the letter \"T\". Now you are ready to begin the exercise.",
      "While keeping the upper arms perpendicular to the torso, pull the barbell up towards your upper chest as you squeeze the rear delts and you breathe out. Tip: When performed correctly, this exercise should resemble a bench press in reverse. Also, refrain from using your biceps to do the work. Focus on targeting the rear delts; the arms should only act as hooks.",
      "Slowly go back to the initial position as you breathe in.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Barbell_Rear_Delt_Row",
    "original_name": "Barbell Rear Delt Row",
    "app_category": "shoulders"
  },
  {
    "name": "Barbell Standing Bradford Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "triceps"
    ],
    "instructions": [
      "Place a loaded bar at shoulder level in a rack. With a pronated grip at shoulder width, begin with the bar racked across the front of your shoulders. This is your starting position.",
      "Initiate the lift by extending the elbows to press the bar overhead. Avoid locking out the elbow as you move the weight behind your head.",
      "Lower the bar down to the back of the head until your elbow forms a right angle.",
      "Lift the bar back over your head by extending the elbows",
      "Lower the bar down to the starting position.",
      "Alternate in this manner until you complete the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Standing_Bradford_Press",
    "original_name": "Standing Bradford Press",
    "app_category": "shoulders"
  },
  {
    "name": "Barbell Standing Military Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "triceps"
    ],
    "instructions": [
      "Start by placing a barbell that is about chest high on a squat rack. Once you have selected the weights, grab the barbell using a pronated (palms facing forward) grip. Make sure to grip the bar wider than shoulder width apart from each other.",
      "Slightly bend the knees and place the barbell on your collar bone. Lift the barbell up keeping it lying on your chest. Take a step back and position your feet shoulder width apart from each other.",
      "Once you pick up the barbell with the correct grip length, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position.",
      "Lower the bar down to the collarbone slowly as you inhale.",
      "Lift the bar back up to the starting position as you exhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Standing_Military_Press",
    "original_name": "Standing Military Press",
    "app_category": "shoulders"
  },
  {
    "name": "Car Drivers",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "forearms"
    ],
    "instructions": [
      "While standing upright, hold a barbell plate in both hands at the 3 and 9 o'clock positions. Your palms should be facing each other and your arms should be extended straight out in front of you. This will be your starting position.",
      "Initiate the movement by rotating the plate as far to one side as possible. Use the same type of movement you would use to turn a steering wheel to one side.",
      "Reverse the motion, turning it all the way to the opposite side.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Car_Drivers",
    "original_name": "Car Drivers",
    "app_category": "shoulders"
  },
  {
    "name": "Dumbbell Raise",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "biceps"
    ],
    "instructions": [
      "Grab a dumbbell in each arm and stand up straight with your arms extended by your sides with a slight bend at the elbows and your back straight. This will be your starting position. Tip: The dumbbell should be next to your thighs with the palm of your hands facing back.",
      "Use your side shoulders to lift the dumbbells as you exhale. The dumbbells should be to the side of the body as you move them up. Continue to lift it until the dumbbells are nearly in line with your chin. Tip: Your elbows should drive the motion. As you lift the dumbbell, your elbow should always be higher than your forearm. Also, keep your torso stationary and pause for a second at the top of the movement.",
      "Lower the dumbbells back down slowly to the starting position. Inhale as you perform this portion of the movement.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Dumbbell_Raise",
    "original_name": "Dumbbell Raise",
    "app_category": "shoulders"
  },
  {
    "name": "Dumbbell Scaption",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "traps"
    ],
    "instructions": [
      "This corrective exercise strengthens the muscles that stabilize your shoulder blade. Hold a light weight in each hand, hanging at your sides. Your thumbs should pointing up.",
      "Begin the movement raising your arms out in front of you, about 30 degrees off center. Your arms should be fully extended as you perform the movement.",
      "Continue until your arms are parallel to the ground, and then return to the starting position."
    ],
    "category": "strength",
    "id": "Dumbbell_Scaption",
    "original_name": "Dumbbell Scaption",
    "app_category": "shoulders"
  },
  {
    "name": "Elbow Circles",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "traps"
    ],
    "instructions": [
      "Sit or stand with your feet slightly apart.",
      "Place your hands on your shoulders with your elbows at shoulder level and pointing out.",
      "Slowly make a circle with your elbows. Breathe out as you start the circle and breathe in as you complete the circle."
    ],
    "category": "stretching",
    "id": "Elbow_Circles",
    "original_name": "Elbow Circles",
    "app_category": "shoulders"
  },
  {
    "name": "External Rotation",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie sideways on a flat bench with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it.",
      "Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm. Tip: Keep the arm parallel to your torso.",
      "Now bend the elbow while keeping the upper arm stationary. In this manner, the forearm will be parallel to the floor and perpendicular to your torso (Tip: So the forearm will be directly in front of you). The upper arm will be stationary by your torso and should be parallel to the floor (aligned with your torso at all times). This will be your starting position.",
      "As you breathe out, externally rotate your forearm so that the dumbbell is lifted up in a semicircle motion as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is perpendicular to the floor and the torso pointing towards the ceiling. At this point you will hold the contraction for a second.",
      "As you breathe in, slowly go back to the starting position.",
      "Repeat for the recommended amount of repetitions and then switch to the other arm."
    ],
    "category": "strength",
    "id": "External_Rotation",
    "original_name": "External Rotation",
    "app_category": "shoulders"
  },
  {
    "name": "Front Dumbbell Raise",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Pick a couple of dumbbells and stand with a straight torso and the dumbbells on front of your thighs at arms length with the palms of the hand facing your thighs. This will be your starting position.",
      "While maintaining the torso stationary (no swinging), lift the left dumbbell to the front with a slight bend on the elbow and the palms of the hands always facing down. Continue to go up until you arm is slightly above parallel to the floor. Exhale as you execute this portion of the movement and pause for a second at the top. Inhale after the second pause.",
      "Now lower the dumbbell back down slowly to the starting position as you simultaneously lift the right dumbbell.",
      "Continue alternating in this fashion until all of the recommended amount of repetitions have been performed for each arm."
    ],
    "category": "strength",
    "id": "Front_Dumbbell_Raise",
    "original_name": "Front Dumbbell Raise",
    "app_category": "shoulders"
  },
  {
    "name": "One-Arm Side Laterals",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Pick a dumbbell and place it in one of your hands. Your non lifting hand should be used to grab something steady such as an incline bench press. Lean towards your lifting arm and away from the hand that is gripping the incline bench as this will allow you to keep your balance.",
      "Stand with a straight torso and have the dumbbell by your side at arm's length with the palm of the hand facing you. This will be your starting position.",
      "While maintaining the torso stationary (no swinging), lift the dumbbell to your side with a slight bend on the elbow and your hand slightly tilted forward as if pouring water in a glass. Continue to go up until you arm is parallel to the floor. Exhale as you execute this movement and pause for a second at the top.",
      "Lower the dumbbell back down slowly to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions.",
      "Switch arms and repeat the exercise."
    ],
    "category": "strength",
    "id": "One-Arm_Side_Laterals",
    "original_name": "One-Arm Side Laterals",
    "app_category": "shoulders"
  },
  {
    "name": "Power Partials",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso.",
      "The palms of the hands should be facing your torso. Your feet should be about shoulder width apart. This will be your starting position.",
      "Keeping your arms straight and the torso stationary, lift the weights out to your sides until they are about shoulder level height while exhaling.",
      "Feel the contraction for a second and begin to lower the weights back down to the starting position while inhaling. Tip: Keep the palms facing down with the little finger slightly higher while lifting and lowering the weights as it will concentrate the stress on your shoulders mainly.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Power_Partials",
    "original_name": "Power Partials",
    "app_category": "shoulders"
  },
  {
    "name": "Seated Dumbbell Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "triceps"
    ],
    "instructions": [
      "Grab a couple of dumbbells and sit on a military press bench or a utility bench that has a back support on it as you place the dumbbells upright on top of your thighs.",
      "Clean the dumbbells up one at a time by using your thighs to bring the dumbbells up to shoulder height at each side.",
      "Rotate the wrists so that the palms of your hands are facing forward. This is your starting position.",
      "As you exhale, push the dumbbells up until they touch at the top.",
      "After a second pause, slowly come down back to the starting position as you inhale.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Seated_Dumbbell_Press",
    "original_name": "Seated Dumbbell Press",
    "app_category": "shoulders"
  },
  {
    "name": "Shoulder Raise",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "lats"
    ],
    "instructions": [
      "Relax your arms to your sides and raise your shoulders up toward your ears, then back down."
    ],
    "category": "stretching",
    "id": "Shoulder_Raise",
    "original_name": "Shoulder Raise",
    "app_category": "shoulders"
  },
  {
    "name": "Single Dumbbell Raise",
    "altNames": [],
    "force": null,
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "forearms",
      "traps"
    ],
    "instructions": [
      "With a wide stance, hold a dumbell with both hands, grasping the head of the dumbbell instead of the handle. Your arms should be extended and hanging at the waist. This will be your starting position.",
      "Raise the weight until it is above shoulder level, keeping your arms extended. Your torso and hips should remain stationary throughout the movement.",
      "Return to the starting position and repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Single_Dumbbell_Raise",
    "original_name": "Single Dumbbell Raise",
    "app_category": "shoulders"
  },
  {
    "name": "Upright Barbell Row",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "traps"
    ],
    "instructions": [
      "Grasp a barbell with an overhand grip that is slightly less than shoulder width. The bar should be resting on the top of your thighs with your arms extended and a slight bend in your elbows. Your back should also be straight. This will be your starting position.",
      "Now exhale and use the sides of your shoulders to lift the bar, raising your elbows up and to the side. Keep the bar close to your body as you raise it. Continue to lift the bar until it nearly touches your chin. Tip: Your elbows should drive the motion, and should always be higher than your forearms. Remember to keep your torso stationary and pause for a second at the top of the movement.",
      "Lower the bar back down slowly to the starting position. Inhale as you perform this portion of the movement.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Upright_Barbell_Row",
    "original_name": "Upright Barbell Row",
    "app_category": "shoulders"
  },
  {
    "name": "Upward Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "shoulders"
    ],
    "secondaryMuscles": [
      "chest",
      "lats"
    ],
    "instructions": [
      "Extend both hands straight above your head, palms touching.",
      "Slowly push your hands up and back, keeping your back straight."
    ],
    "category": "stretching",
    "id": "Upward_Stretch",
    "original_name": "Upward Stretch",
    "app_category": "shoulders"
  },
  {
    "name": "Adductor",
    "altNames": [],
    "force": "static",
    "level": "intermediate",
    "mechanic": "isolation",
    "equipment": "foam roll",
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie face down with one leg on a foam roll.",
      "Rotate the leg so that the foam roll contacts against your inner thigh. Shift as much weight onto the foam roll as can be tolerated.",
      "While trying to relax the muscles if the inner thigh, roll over the foam between your hip and knee, holding points of tension for 10-30 seconds. Repeat with the other leg."
    ],
    "category": "stretching",
    "id": "Adductor",
    "original_name": "Adductor",
    "app_category": "stretching"
  },
  {
    "name": "Adductor/Groin",
    "altNames": [],
    "force": "static",
    "level": "intermediate",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie on your back with your feet raised towards the ceiling.",
      "Have your partner hold your feet or ankles. Abduct your legs as far as you can. This will be your starting position.",
      "Attempt to squeeze your legs together for 10 or more seconds, while your partner prevents you from doing so.",
      "Now, relax the muscles in your legs as your partner pushes your feet apart, stretching as far as is comfortable for you. Be sure to let your partner know when the stretch is adequate to prevent overstretching or injury."
    ],
    "category": "stretching",
    "id": "Adductor_Groin",
    "original_name": "Adductor/Groin",
    "app_category": "stretching"
  },
  {
    "name": "Chin To Chest Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": null,
    "equipment": null,
    "primaryMuscles": [
      "neck"
    ],
    "secondaryMuscles": [
      "traps"
    ],
    "instructions": [
      "Get into a seated position on the floor.",
      "Place both hands at the rear of your head, fingers interlocked, thumbs pointing down and elbows pointing straight ahead. Slowly pull your head down to your chest. Hold for 20-30 seconds."
    ],
    "category": "stretching",
    "id": "Chin_To_Chest_Stretch",
    "original_name": "Chin To Chest Stretch",
    "app_category": "stretching"
  },
  {
    "name": "Groin and Back Stretch",
    "altNames": [],
    "force": "static",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": null,
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Sit on the floor with your knees bent and feet together.",
      "Interlock your fingers behind your head. This will be your starting position.",
      "Curl downwards, bringing your elbows to the inside of your thighs. After a brief pause, return to the starting position with your head up and your back straight. Repeat for 10-20 repetitions."
    ],
    "category": "stretching",
    "id": "Groin_and_Back_Stretch",
    "original_name": "Groin and Back Stretch",
    "app_category": "stretching"
  },
  {
    "name": "Groiners",
    "altNames": [],
    "force": "pull",
    "level": "intermediate",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Begin in a pushup position on the floor. This will be your starting position.",
      "Using both legs, jump forward landing with your feet next to your hands. Keep your head up as you do so.",
      "Return to the starting position and immediately repeat the movement, continuing for 10-20 repetitions."
    ],
    "category": "stretching",
    "id": "Groiners",
    "original_name": "Groiners",
    "app_category": "stretching"
  },
  {
    "name": "Hip Circles (prone)",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "abductors"
    ],
    "secondaryMuscles": [
      "adductors"
    ],
    "instructions": [
      "Position yourself on your hands and knees on the ground. Maintaining good posture, raise one bent knee off of the ground. This will be your starting position.",
      "Keeping the knee in a bent position, rotate the femur in an arc, attempting to make a big circle with your knee.",
      "Perform this slowly for a number of repetitions, and repeat on the other side."
    ],
    "category": "stretching",
    "id": "Hip_Circles_prone",
    "original_name": "Hip Circles (prone)",
    "app_category": "stretching"
  },
  {
    "name": "Iliotibial Tract-SMR",
    "altNames": [],
    "force": "static",
    "level": "intermediate",
    "mechanic": "isolation",
    "equipment": "foam roll",
    "primaryMuscles": [
      "abductors"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lay on your side, with the bottom leg placed onto a foam roller between the hip and the knee. The other leg can be crossed in front of you.",
      "Place as much of your weight as is tolerable onto your bottom leg; there is no need to keep your bottom leg in contact with the ground. Be sure to relax the muscles of the leg you are stretching.",
      "Roll your leg over the foam from you hip to your knee, pausing for 10-30 seconds at points of tension. Repeat with the opposite leg."
    ],
    "category": "stretching",
    "id": "Iliotibial_Tract-SMR",
    "original_name": "Iliotibial Tract-SMR",
    "app_category": "stretching"
  },
  {
    "name": "Side Leg Raises",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": null,
    "equipment": "body only",
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Stand next to a chair, which you may hold onto as a support. Stand on one leg. This will be your starting position.",
      "Keeping your leg straight, raise it as far out to the side as possible, and swing it back down, allowing it to cross the opposite leg.",
      "Repeat this swinging motion 5-10 times, increasing the range of motion as you do so."
    ],
    "category": "stretching",
    "id": "Side_Leg_Raises",
    "original_name": "Side Leg Raises",
    "app_category": "stretching"
  },
  {
    "name": "Side Lying Groin Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "adductors"
    ],
    "secondaryMuscles": [
      "hamstrings"
    ],
    "instructions": [
      "Start off by lying on your right side and bend your right knee in front of you to stabilize the torso.",
      "Rest your head on your right hand or shoulder. Lift your left leg upward and hold it by the back of the knee (easier) or the foot (harder).",
      "Pull your left knee in toward your left shoulder and simultaneously press your foot or knee down to the floor. To intensify this stretch, straighten your left leg. Switch sides."
    ],
    "category": "stretching",
    "id": "Side_Lying_Groin_Stretch",
    "original_name": "Side Lying Groin Stretch",
    "app_category": "stretching"
  },
  {
    "name": "Side Neck Stretch",
    "altNames": [],
    "force": "static",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": null,
    "primaryMuscles": [
      "neck"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Start with your shoulders relaxed, gently tilt your head towards your shoulder.",
      "Assist stretch with a gentle pull on the side of the head."
    ],
    "category": "stretching",
    "id": "Side_Neck_Stretch",
    "original_name": "Side Neck Stretch",
    "app_category": "stretching"
  },
  {
    "name": "Standing Hip Circles",
    "altNames": [],
    "force": "pull",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "abductors"
    ],
    "secondaryMuscles": [
      "adductors"
    ],
    "instructions": [
      "Begin standing on one leg, holding to a vertical support.",
      "Raise the unsupported knee to 90 degrees. This will be your starting position.",
      "Open the hip as far as possible, attempting to make a big circle with your knee.",
      "Perform this movement slowly for a number of repetitions, and repeat on the other side."
    ],
    "category": "stretching",
    "id": "Standing_Hip_Circles",
    "original_name": "Standing Hip Circles",
    "app_category": "stretching"
  },
  {
    "name": "Barbell Decline EZ Bar Triceps Extension",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Secure your legs at the end of the decline bench and slowly lay down on the bench.",
      "Using a close grip (a grip that is slightly less than shoulder width), lift the EZ bar from the rack and hold it straight over you with your arms locked and elbows in. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.",
      "As you breathe in and you keep the upper arms stationary, bring the bar down slowly by moving your forearms in a semicircular motion towards you until you feel the bar slightly touch your forehead. Breathe in as you perform this portion of the movement.",
      "Lift the bar back to the starting position by contracting the triceps and exhaling.",
      "Repeat until the recommended amount of repetitions is performed."
    ],
    "category": "strength",
    "id": "Decline_EZ_Bar_Triceps_Extension",
    "original_name": "Decline EZ Bar Triceps Extension",
    "app_category": "triceps"
  },
  {
    "name": "Barbell JM Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Start the exercise the same way you would a close grip bench press. You will lie on a flat bench while holding a barbell at arms length (fully extended) with the elbows in. However, instead of having the arms perpendicular to the torso, make sure the bar is set in a direct line above the upper chest. This will be your starting position.",
      "Now beginning from a fully extended position lower the bar down as if performing a lying triceps extension. Inhale as you perform this movement. When you reach the half way point, let the bar roll back about one inch by moving the upper arms towards your legs until they are perpendicular to the torso. Tip: Keep the bend at the elbows constant as you bring the upper arms forward.",
      "As you exhale, press the bar back up by using the triceps to perform a close grip bench press.",
      "Now go back to the starting position and start over.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "JM_Press",
    "original_name": "JM Press",
    "app_category": "triceps"
  },
  {
    "name": "Bench Dips",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "For this exercise you will need to place a bench behind your back. With the bench perpendicular to your body, and while looking away from it, hold on to the bench on its edge with the hands fully extended, separated at shoulder width. The legs will be extended forward, bent at the waist and perpendicular to your torso. This will be your starting position.",
      "Slowly lower your body as you inhale by bending at the elbows until you lower yourself far enough to where there is an angle slightly smaller than 90 degrees between the upper arm and the forearm. Tip: Keep the elbows as close as possible throughout the movement. Forearms should always be pointing down.",
      "Using your triceps to bring your torso up again, lift yourself back to the starting position.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Bench_Dips",
    "original_name": "Bench Dips",
    "app_category": "triceps"
  },
  {
    "name": "Body Tricep Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Position a bar in a rack at chest height.",
      "Standing, take a shoulder width grip on the bar and step a yard or two back, feet together and arms extended so that you are leaning on the bar. This will be your starting position.",
      "Begin by flexing the elbow, lowering yourself towards the bar.",
      "Pause, and then reverse the motion by extending the elbows.",
      "Progress from bodyweight by adding chains over your shoulders."
    ],
    "category": "strength",
    "id": "Body_Tricep_Press",
    "original_name": "Body Tricep Press",
    "app_category": "triceps"
  },
  {
    "name": "Close-Grip Barbell Bench Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "barbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Lie back on a flat bench. Using a close grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.",
      "As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that - as opposed to a regular bench press - you keep the elbows close to the torso at all times in order to maximize triceps involvement.",
      "After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.",
      "Repeat the movement for the prescribed amount of repetitions.",
      "When you are done, place the bar back in the rack."
    ],
    "category": "strength",
    "id": "Close-Grip_Barbell_Bench_Press",
    "original_name": "Close-Grip Barbell Bench Press",
    "app_category": "triceps"
  },
  {
    "name": "Close-Grip Dumbbell Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Place a dumbbell standing up on a flat bench.",
      "Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench with only your shoulders lying on the surface. Hips should be below the bench and your legs bent with your feet firmly on the floor.",
      "Grasp the dumbbell with both hands and hold it straight over your chest at arm's length. Both palms should be pressing against the underside of the sides of the dumbbell. This will be your starting position.",
      "Initiate the movement by lowering the dumbbell to your chest.",
      "Return to the starting position by extending the elbows."
    ],
    "category": "strength",
    "id": "Close-Grip_Dumbbell_Press",
    "original_name": "Close-Grip Dumbbell Press",
    "app_category": "triceps"
  },
  {
    "name": "Decline Dumbbell Triceps Extension",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.",
      "Once you are laying down, move the dumbbells in front of you at shoulder width. The palms of the hands should be facing each other and the arms should be perpendicular to the floor and fully extended. This will be your starting position.",
      "As you breathe in and you keep the upper arms stationary (and elbows in), bring the dumbbells down slowly by moving your forearms in a semicircular motion towards you until your thumbs are next to your ears. Breathe in as you perform this portion of the movement.",
      "Lift the dumbbells back to the starting position by contracting the triceps and exhaling.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Decline_Dumbbell_Triceps_Extension",
    "original_name": "Decline Dumbbell Triceps Extension",
    "app_category": "triceps"
  },
  {
    "name": "Dips - Triceps Version",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "To get into the starting position, hold your body at arm's length with your arms nearly locked above the bars.",
      "Now, inhale and slowly lower yourself downward. Your torso should remain upright and your elbows should stay close to your body. This helps to better focus on tricep involvement. Lower yourself until there is a 90 degree angle formed between the upper arm and forearm.",
      "Then, exhale and push your torso back up using your triceps to bring your body back to the starting position.",
      "Repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Dips_-_Triceps_Version",
    "original_name": "Dips - Triceps Version",
    "app_category": "triceps"
  },
  {
    "name": "Dumbbell Seated Triceps Press",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Sit down on a bench with back support and grasp a dumbbell with both hands and hold it overhead at arm's length. Tip: a better way is to have somebody hand it to you especially if it is very heavy. The resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hand should be facing inward. This will be your starting position.",
      "Keeping your upper arms close to your head (elbows in) and perpendicular to the floor, lower the resistance in a semi-circular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.",
      "Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Seated_Triceps_Press",
    "original_name": "Seated Triceps Press",
    "app_category": "triceps"
  },
  {
    "name": "Dumbbell Tricep Extension -Pronated Grip",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie down on a flat bench holding two dumbbells directly above your shoulders. Your arms should be fully extended and form a 90 degree angle from your torso and the floor.",
      "The palms of your hands should be facing forward, and your elbows should be tucked in. This will be your starting position.",
      "Now, inhale and slowly lower the dumbbells until they are near your ears. Be sure to keep your upper arms stationary and your elbows tucked in.",
      "Then, exhale and use your triceps to return the weight to the starting position."
    ],
    "category": "strength",
    "id": "Dumbbell_Tricep_Extension_-Pronated_Grip",
    "original_name": "Dumbbell Tricep Extension -Pronated Grip",
    "app_category": "triceps"
  },
  {
    "name": "Incline Push-Up Close-Grip",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "compound",
    "equipment": "body only",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [
      "chest",
      "shoulders"
    ],
    "instructions": [
      "Stand facing a Smith machine bar or sturdy elevated platform at an appropriate height.",
      "Place your hands next to one another on the bar.",
      "Position your feet back from the bar with arms and body straight. This will be your starting position.",
      "Keeping your body straight, lower your chest to the bar by bending the arms.",
      "Return to the starting position by extending the elbows, pressing yourself back up."
    ],
    "category": "strength",
    "id": "Incline_Push-Up_Close-Grip",
    "original_name": "Incline Push-Up Close-Grip",
    "app_category": "triceps"
  },
  {
    "name": "One Arm Pronated Dumbbell Triceps Extension",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Lie flat on a bench while holding a dumbbell at arms length. Your arm should be perpendicular to your body. The palm of your hand should be facing towards your feet as a pronated grip is required to perform this exercise.",
      "Place your non lifting hand on your bicep for support.",
      "Slowly begin to lower the dumbbell down as you breathe in.",
      "Then, begin lifting the dumbbell upward as you contract the triceps. Remember to breathe out during the concentric (lifting part of the exercise).",
      "Repeat until you have performed your set repetitions.",
      "Switch arms and repeat the movement."
    ],
    "category": "strength",
    "id": "One_Arm_Pronated_Dumbbell_Triceps_Extension",
    "original_name": "One Arm Pronated Dumbbell Triceps Extension",
    "app_category": "triceps"
  },
  {
    "name": "Standing Dumbbell Triceps Extension",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "To begin, stand up with a dumbbell held by both hands. Your feet should be about shoulder width apart from each other. Slowly use both hands to grab the dumbbell and lift it over your head until both arms are fully extended.",
      "The resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hands should be facing up towards the ceiling. This will be your starting position.",
      "Keeping your upper arms close to your head with elbows in and perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.",
      "Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Standing_Dumbbell_Triceps_Extension",
    "original_name": "Standing Dumbbell Triceps Extension",
    "app_category": "triceps"
  },
  {
    "name": "Standing Towel Triceps Extension",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "body only",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "To begin, stand up with both arms fully extended above the head holding one end of a towel with both hands. Your elbows should be in and the arms perpendicular to the floor with the palms facing each other while your feet should be shoulder width apart from each other. This is the starting position.",
      "Now communicate with your partner so that he/she can grip the other side of the towel to apply resistance. Keeping your upper arms close to your head (elbows in) and perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.",
      "Go back to the starting position by using the triceps to raise the towel. Breathe out as you perform this step.",
      "Repeat for the recommended amount of repetitions."
    ],
    "category": "strength",
    "id": "Standing_Towel_Triceps_Extension",
    "original_name": "Standing Towel Triceps Extension",
    "app_category": "triceps"
  },
  {
    "name": "Tricep Dumbbell Kickback",
    "altNames": [],
    "force": "push",
    "level": "beginner",
    "mechanic": "isolation",
    "equipment": "dumbbell",
    "primaryMuscles": [
      "triceps"
    ],
    "secondaryMuscles": [],
    "instructions": [
      "Start with a dumbbell in each hand and your palms facing your torso. Keep your back straight with a slight bend in the knees and bend forward at the waist. Your torso should be almost parallel to the floor. Make sure to keep your head up. Your upper arms should be close to your torso and parallel to the floor. Your forearms should be pointed towards the floor as you hold the weights. There should be a 90-degree angle formed between your forearm and upper arm. This is your starting position.",
      "Now, while keeping your upper arms stationary, exhale and use your triceps to lift the weights until the arm is fully extended. Focus on moving the forearm.",
      "After a brief pause at the top contraction, inhale and slowly lower the dumbbells back down to the starting position.",
      "Repeat the movement for the prescribed amount of repetitions."
    ],
    "category": "strength",
    "id": "Tricep_Dumbbell_Kickback",
    "original_name": "Tricep Dumbbell Kickback",
    "app_category": "triceps"
  }
]